[
  {
    "id": "ee2a6ef871472e43de551ef423293358",
    "title": "Revolutionary AI Breakthrough in Local Processing",
    "summary": "Researchers achieve significant improvements in on-device AI processing, enabling faster and more private artificial intelligence applications.",
    "content": "A team of researchers has developed new techniques for optimizing AI models to run efficiently on local devices, reducing the need for cloud processing and improving user privacy. The breakthrough includes novel quantization methods and hardware acceleration techniques.",
    "source": "Mock_News",
    "url": "https://example.com/article/technology/0",
    "published_at": "2025-07-20T12:32:42.702296",
    "category": "technology",
    "language": "en",
    "importance": 0.9,
    "processed_at": 1752989562.7023432
  },
  {
    "id": "dc25b192abc901a150e563ab5d087560",
    "title": "Voice AI Systems Reach Human-Level Understanding",
    "summary": "Latest voice recognition and response systems demonstrate unprecedented accuracy in natural language understanding and generation.",
    "content": "Modern voice assistant technology has achieved remarkable milestones in understanding context, emotion, and nuanced human communication, making interactions more natural and helpful than ever before.",
    "source": "Mock_News",
    "url": "https://example.com/article/technology/1",
    "published_at": "2025-07-20T11:32:42.702350",
    "category": "technology",
    "language": "en",
    "importance": 0.8,
    "processed_at": 1752989562.7023535
  },
  {
    "id": "d57ebf684852bd0e0ea554c2d469fc6e",
    "title": "Quantum Computing Achieves New Stability Record",
    "summary": "Scientists maintain quantum coherence for record-breaking duration, bringing practical quantum computers closer to reality.",
    "content": "A breakthrough in quantum error correction and coherence maintenance has been achieved, with quantum states remaining stable for over 100 seconds under controlled conditions.",
    "source": "Mock_News",
    "url": "https://example.com/article/science/0",
    "published_at": "2025-07-20T12:32:42.702357",
    "category": "science",
    "language": "en",
    "importance": 0.8,
    "processed_at": 1752989562.7023587
  },
  {
    "id": "0acbdd7ebf00d0ddb74a539719358bf6",
    "title": "A Surprise Pokémon Game Just Dropped for Switch and Mobile",
    "summary": "Pokémon Friends, available now, is a daily puzzle game that lets players untangle yarn to make prizes.",
    "content": "Pokémon Friends, available now, is a daily puzzle game that lets players untangle yarn to make prizes.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/a-surprise-pokemon-game-just-dropped-for-switch-and-mobile/",
    "published_at": "2025-07-22T15:59:18",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205396.7708008
  },
  {
    "id": "dcb753f18fa3ad98aa4cac3978324ddd",
    "title": "Everything Is a ‘False Flag’ Now",
    "summary": "Conspiracy theories about so-called false-flag attacks have been around for decades. But as trust in media and public institutions craters, every single major news event is now being labeled as fake.",
    "content": "Conspiracy theories about so-called false-flag attacks have been around for decades. But as trust in media and public institutions craters, every single major news event is now being labeled as fake.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/false-flag-conspiracy-theory-trump/",
    "published_at": "2025-07-22T15:18:56",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205396.77087
  },
  {
    "id": "a18e089364423f05d8d662e4724dbc25",
    "title": "This Is the Best Sleeping Bag",
    "summary": "The only problem with sleeping outside is that … you’re outside. Rumpl’s Wrap Sack solves all your crazy temperature woes.",
    "content": "The only problem with sleeping outside is that … you’re outside. Rumpl’s Wrap Sack solves all your crazy temperature woes.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/rumpl-wrap-sack-perfect-sleeping-bag/",
    "published_at": "2025-07-22T13:03:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205396.7709284
  },
  {
    "id": "173dafe7f4c5a5c798f23ff2114e014a",
    "title": "14 Best USB Flash Drives (2025): Pen Drives, Thumb Drives, Memory Sticks",
    "summary": "These WIRED-tested memory sticks are a virtual filing cabinet in your pocket.",
    "content": "These WIRED-tested memory sticks are a virtual filing cabinet in your pocket.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/gallery/best-usb-flash-drives/",
    "published_at": "2025-07-22T12:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205396.770984
  },
  {
    "id": "f6e2fa5b70b4dd9ac784ba8e4a55a5ee",
    "title": "Fiberglass-Free, Chemical-Free: Natural Fire Barriers for Mattresses",
    "summary": "When it comes to flame retardants, fiberglass is unhealthy, but many chemicals are worse. Here’s what you need to know about buying a safe new mattress.",
    "content": "When it comes to flame retardants, fiberglass is unhealthy, but many chemicals are worse. Here’s what you need to know about buying a safe new mattress.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/mattress-fire-retardants-and-alternatives/",
    "published_at": "2025-07-22T11:41:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205396.771039
  },
  {
    "id": "45755c838e4577a445c0ce9c52234e27",
    "title": "X Data Center Fire in Oregon Started Inside Power Cabinet, Authorities Say",
    "summary": "Generative AI has put data centers under the spotlight, and surging electricity needs could increase risk of fires.",
    "content": "Generative AI has put data centers under the spotlight, and surging electricity needs could increase risk of fires.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/x-data-center-fire-in-oregon-started-inside-power-cabinet-authorities-say/",
    "published_at": "2025-07-22T11:01:20",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205396.7710948
  },
  {
    "id": "f564e6aba2e1579424a08b74ca56aba9",
    "title": "How to Spot and Guard Against Wrong Number Scams",
    "summary": "Ever gotten a text from a number you didn’t recognize? These communications are not as innocent as they might seem.",
    "content": "Ever gotten a text from a number you didn’t recognize? These communications are not as innocent as they might seem.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/how-to-spot-and-guard-against-wrong-number-scams/",
    "published_at": "2025-07-22T11:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205396.7711482
  },
  {
    "id": "f4e3bfd903bb6248bf5358098ec9fdf0",
    "title": "OpenAI’s ChatGPT Agent Is Haunting My Browser",
    "summary": "New tools from OpenAI and Perplexity can browse the web for you. If the idea takes off, these generative AI agents could turn the internet into a ghost town where only bots roam.",
    "content": "New tools from OpenAI and Perplexity can browse the web for you. If the idea takes off, these generative AI agents could turn the internet into a ghost town where only bots roam.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/browser-haunted-by-ai-agents/",
    "published_at": "2025-07-22T10:30:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205396.7712233
  },
  {
    "id": "090172ecbf5ffefebbd2f4b3b137fd37",
    "title": "Did Tesla’s Robotaxi Launch Backfire?",
    "summary": "Survey data shared exclusively with WIRED suggests that Tesla’s newest autonomous driving technology has freaked out some consumers.",
    "content": "Survey data shared exclusively with WIRED suggests that Tesla’s newest autonomous driving technology has freaked out some consumers.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/tesla-robotaxi-launch-survey-data/",
    "published_at": "2025-07-22T10:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205396.7712803
  },
  {
    "id": "c700fa1fec23abeaaf7c62b70def1b0c",
    "title": "Newly Discovered ‘Infinity Galaxy’ Could Prove How Ancient Supermassive Black Holes Formed",
    "summary": "This collision of two galaxies could demonstrate that theorized “direct collapse black holes” exist.",
    "content": "This collision of two galaxies could demonstrate that theorized “direct collapse black holes” exist.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/newly-discovered-infinity-galaxy-could-prove-how-ancient-supermassive-black-holes-formed/",
    "published_at": "2025-07-22T09:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205396.7713337
  },
  {
    "id": "c95102a2e7a0b737cc7786bf7423f6b0",
    "title": "“Surface Laptop 5G” for businesses shows Microsoft isn’t done with Intel yet",
    "summary": "For businesses and individuals with software that can't run on Arm-based PCs.",
    "content": "Microsoft has gone all-in on Arm-based Qualcomm Snapdragon X-series chips for its Surface PCs, including the less-expensive-but-more-compromised 13-inch Surface Laptop and 12-inch Surface Pro from this spring. But the company still hasn't quite given up on businesses and individuals who still want or require a traditional Intel or AMD-based x86 PC.\nThe latest addition to the lineup is the \"Surface Laptop 5G,\" an updated version of the Intel-based 13.8-inch Surface Laptop with built-in 5G cellular connectivity. The system looks largely identical to the non-5G version, but Microsoft says it has been redesigned internally with \"a dynamic antenna system\" and \"a custom multi-layered laminate,\" which improve signal strength.\nThe Surface Laptop 5G uses the same Core Ultra Series 2 chips (codenamed Lunar Lake) as the PCs Microsoft released in January. These chips include respectable Intel Arc integrated GPUs, as well as neural processing units (NPUs) fast enough to qualify for Windows 11's extra Copilot+ PC features.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/gadgets/2025/07/surface-laptop-5g-for-businesses-shows-microsoft-isnt-done-with-intel-yet/",
    "published_at": "2025-07-22T17:00:22",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.526953
  },
  {
    "id": "658f640275afac6fc554a6668b67ac91",
    "title": "Trump wants to “eliminate or expedite” environmental rules for rocket launches",
    "summary": "SpaceX, other commercial launch firms, have been seeking this change in policy.",
    "content": "The Trump administration is considering slashing rules meant to protect the environment and the public during commercial rocket launches, changes that companies like Elon Musk’s SpaceX have long sought.\nA draft executive order being circulated among federal agencies, and viewed by ProPublica, directs Secretary of Transportation Sean Duffy to “use all available authorities to eliminate or expedite” environmental reviews for launch licenses. It could also, in time, require states to allow more launches or even more launch sites—known as spaceports—along their coastlines.\nThe order is a step toward the rollback of federal oversight that Musk, who has fought bitterly with the Federal Aviation Administration over his space operations, and others have pushed for. Commercial rocket launches have grown exponentially more frequent in recent years.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/space/2025/07/environmental-protection-rules-for-rocket-launches-targeted-by-trump-administration/",
    "published_at": "2025-07-22T16:48:59",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.527164
  },
  {
    "id": "daa3a47d517155acbf84f7a9d2ee450f",
    "title": "LA’s Museum of Jurassic Technology damaged by fire",
    "summary": "The fire gutted the museum's gift shop and caused significant smoke damage to several exhibits.",
    "content": "One of the quirkier cultural gems in Los Angeles is the Museum of Jurassic Technology (MJT), featuring an eclectic collection of exhibits (of varying authenticity) inspired by historical Renaissance \"cabinets of curiosities\" (wunderkammers). It hasn't been broadly reported, but earlier this month, a fire broke out late at night, gutting the museum's gift shop and inflicting smoke damage on several exhibits, with lost revenues estimated to be around $75,000 until the doors reopen sometime next month.\nThe museum was founded in 1988 by David Hildebrand Wilson and Diana Drake Wilson, \"dedicated to the advancement of knowledge and the public appreciation of the Lower Jurassic.\" The collections don't actually have much to do with that geologic epoch, channeling instead the private natural history collections that became common in the 16th century and the later emergence of public museums in the 19th century. Since 2005 there has also been a Russian tea room, a mini-reconstruction of Tsar Nicholas II's study at the Winter Palace in St. Petersburg, Russia.\nThere are more than 30 permanent exhibits, including one devoted to the life and exploits of the German polymath and Jesuit priest Athanasius Kircher. There is also an exhibit called \"The Garden of Eden on Wheels,\" about LA-area trailer parks; another celebrating the micro-miniature sculptures of Hagop Sandaldjian, carved from a single hair and displayed in the eye of a needle; a collection of stereographic radiographs of flowers; a collection of decomposing antique dice once owned by magician Ricky Jay; 19th-century microscopic mosaics made from butterfly wing scales; and a collection of crackpot letters sent to the Mount Wilson Observatory between 1915 and 1935.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/science/2025/07/las-museum-of-jurassic-technology-damaged-by-fire/",
    "published_at": "2025-07-22T15:10:26",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.527505
  },
  {
    "id": "72e64a4f3e54ec897ac547405e8bd52c",
    "title": "Tesla skepticism continues to grow, robotaxi demo fails to impress Austin",
    "summary": "Worse, fewer and fewer consider the brand safe.",
    "content": "Tesla’s eroding popularity with Americans shows little sign of abating. Each month, the Electric Vehicle Intelligence Report surveys thousands of consumers to gauge attitudes on EV adoption, autonomous driving, and the automakers that are developing those technologies. Toyota, which only recently started selling enough EVs to be included in the survey, currently has the highest net-positive score and the highest “view intensity score”—the percentage of consumers who have a very positive view of a brand minus the ones who have a very negative view—despite selling just a fairly lackluster EV to date. Meanwhile, the brand that actually popularized the EV, moving it from compliance car and milk float to something desirable, has fallen even further into negative territory in July.\nJust 26 percent of survey participants still have a somewhat or very positive view of Tesla. But 39 percent have a somewhat or very negative view of the company, with just 14 percent being unfamiliar or having no opinion. That’s a net positive view of -13, but Tesla’s view intensity score is -16, meaning a lot more people really don’t like the company compared to the ones who really do. The problem is also growing over time: In April, Tesla still had a net positive view of -7.\nTesla remained at the bottom of the charts when EVIR looked more closely into demographic data. Tesla was the least-positively viewed car company regardless of income, although the effect was most pronounced among those with incomes less than $75,000, as were the results based on geography (although suburbanites held it in the most disdain) and age (where those over 65 have the most haters).Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/cars/2025/07/tesla-is-the-least-trusted-car-brand-in-america-survey-finds/",
    "published_at": "2025-07-22T15:00:07",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.5277753
  },
  {
    "id": "756677cc22f023654137d6269567701d",
    "title": "xAI workers balked over training request to help “give Grok a face,” docs show",
    "summary": "Slack messages: Some xAI employees refused to join invasive Grok training.",
    "content": "Dozens of xAI employees expressed concerns—and many objected—when asked to record videos of their facial expressions to help \"give Grok a face,\" Business Insider reported.\nBI reviewed internal documents and Slack messages, finding that the so-called project \"Skippy\" was designed to help Grok learn what a face is and \"interpret human emotions.\"\nIt's unclear from these documents if workers' facial data helped train controversial avatars that xAI released last week, including Ani—an anime companion that flirts and strips—and Rudi—a red panda with a \"Bad\" mode that encourages violence. But a recording of an xAI introductory meeting on \"Skippy\" showed a lead engineer confirming the company \"might eventually use\" the employees' facial data to build out \"avatars of people,\" BI reported.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/tech-policy/2025/07/xai-workers-balked-over-training-request-to-help-give-grok-a-face-docs-show/",
    "published_at": "2025-07-22T14:31:42",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.5282514
  },
  {
    "id": "5b963987c401a29ddf17854a55bb4731",
    "title": "Win for chemical industry as EPA shutters scientific research office",
    "summary": "Companies feared rules and lawsuits based on Office of Research and Development assessments.",
    "content": "Soon after President Donald Trump took office in January, a wide array of petrochemical, mining, and farm industry coalitions ramped up what has been a long campaign to limit use of the Environmental Protection Agency’s assessments of the health risks of chemicals.\nThat effort scored a significant victory Friday when EPA Administrator Lee Zeldin announced his decision to dismantle the agency’s Office of Research and Development (ORD).\nThe industry lobbyists didn’t ask for hundreds of ORD staff members to be laid off or reassigned. But the elimination of the agency’s scientific research arm goes a long way toward achieving the goal they sought.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/science/2025/07/win-for-chemical-industry-as-epa-shutters-scientific-research-office/",
    "published_at": "2025-07-22T13:45:27",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.5285487
  },
  {
    "id": "89ad9099c988eaf89120b7b50d1df659",
    "title": "Nearly 3,000 people are leaving NASA, and this director is one of them",
    "summary": "Makenzie Lystrup's departure from Goddard comes soon after the resignation of the director of JPL.",
    "content": "You can add another name to the thousands of employees leaving NASA as the Trump administration primes the space agency for a 25 percent budget cut.\nOn Monday, NASA announced that Makenzie Lystrup will leave her post as director of the Goddard Space Flight Center on Friday, August 1. Lystrup has held the top job at Goddard since April 2023, overseeing a staff of more than 8,000 civil servants and contractor employees and a budget last year of about $4.7 billion.\nThese figures make Goddard the largest of NASA's 10 field centers primarily devoted to scientific research and development of robotic space missions, with a budget and workforce comparable to NASA's human spaceflight centers in Texas, Florida, and Alabama. Officials at Goddard manage the James Webb and Hubble telescopes in space, and Goddard engineers are assembling the Nancy Grace Roman Space Telescope, another flagship observatory scheduled for launch late next year.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/space/2025/07/the-director-of-nasas-largest-science-center-is-leaving-government/",
    "published_at": "2025-07-21T23:44:05",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.5288558
  },
  {
    "id": "0140a3d643a54b21fd2ad8cb333b1501",
    "title": "Mercedes-AMG gives us a ride in its next high-performance EV",
    "summary": "Mercedes-AMG is following the Ioniq 5 N playbook with simulated shifting and sounds.",
    "content": "Mercedes-Benz provided flights from Detroit to Stuttgart, Germany, and accommodation so Ars could be briefed on the AMG.EA prototype as well as the GT XX that we covered last month. Ars does not accept paid editorial content.\nFirst-generation high-performance electric vehicles, like the Tesla Model S Plaid, had a party trick that would wow first-timers: straight-line acceleration. Feeling your internal organs shift under the G forces of acceleration is cool the first few times but gets annoying after repeated launches. Why? Because a one-trick pony car isn't interesting or fun to enthusiasts.\nMercedes-AMG understands this now, and the company is attempting to make its most engaging, most interesting, and most technologically advanced high-performance EVs ever. Based on the AMG.EA architecture, at least two vehicles have been confirmed. After the reveal of the concept GT XX and the AMG.EA architecture in Affalterbach, the company took me for a ride in a future production version of the car.\nYou might think this car looks like a next-generation AMG GT four-door, but Mercedes won't confirm what it is other than that it's AMG.EA underneath. The purpose of this ride-along isn't to experience the power or performance but, rather, the feel of the car.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/cars/2025/07/mercedes-amg-gives-us-a-ride-in-its-next-high-performance-ev/",
    "published_at": "2025-07-21T22:01:34",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.5291138
  },
  {
    "id": "bac1ff4c35d31e8a19e43e743d96259a",
    "title": "Google gets ahead of the leaks and reveals the Pixel 10 early",
    "summary": "Google's next smartphone keeps the same design.",
    "content": "Google has an event next month to officially launch the Pixel 10 series, but the leaks have been coming fast and furious beforehand. There won't be much left to learn on August 20, particularly now that Google has revealed the phone. Over on the Google Store, there's a video revealing the Pixel 10's design, and it looks just a little familiar.\nThe video (which you can also see below) isn't very long, but it offers an unobscured look at the phone's physical design. The 13-second clip opens with the numeral \"10\" emerging from the shadows. The zero elongates and morphs into the trademark camera window on the back of the phone. The video zooms out to reveal the full phone from the back. The device is a muted blue-gray, which is probably the \"frost\" color listed in recent leaks.\nThe video is not accompanied by specs, pricing, or any other details; however, Google's new Tensor G5 processor is expected to be a marked improvement over past iterations. While the first four Tensor chips were manufactured in Samsung fabs, Tensor G5 is from TSMC. The dominant Taiwanese chip maker touts better semiconductor packaging technology, and the chip itself is believed to have more custom components that further separate it from the Samsung Exynos lineage.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/gadgets/2025/07/google-reveals-the-pixel-10-and-yep-it-looks-like-the-pixel-9/",
    "published_at": "2025-07-21T20:25:14",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.5293229
  },
  {
    "id": "c23bbaacf7ee699df38d592187f83ea0",
    "title": "FCC to eliminate gigabit speed goal and scrap analysis of broadband prices",
    "summary": "Analysis of broadband affordability deemed \"extraneous\" by FCC chair.",
    "content": "The Federal Communications Commission is ditching Biden-era standards for measuring progress toward the goal of universal broadband deployment.\nThe changes will make it easier for the FCC to give the broadband industry a passing grade in an annual progress report. FCC Chairman Brendan Carr's proposal would give the industry a thumbs-up even if it falls short of 100 percent deployment, eliminate a long-term goal of gigabit broadband speeds, and abandon a new effort to track the affordability of broadband.\nSection 706 of the Telecommunications Act requires the FCC to determine whether broadband is being deployed \"on a reasonable and timely basis\" to all Americans. If the answer is no, the US law says the FCC must \"take immediate action to accelerate deployment of such capability by removing barriers to infrastructure investment and by promoting competition in the telecommunications market.\"Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/tech-policy/2025/07/fcc-to-eliminate-gigabit-speed-goal-and-scrap-analysis-of-broadband-prices/",
    "published_at": "2025-07-21T19:49:17",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.5295327
  },
  {
    "id": "325e91d17893be8da400ed4e05ed0074",
    "title": "Fantastic Four: First Steps’ greatest superpower is its gorgeous visuals",
    "summary": "When Disney acquired 21st Century Fox in 2019, you could see flashes of the studio's plan to further expand the Marvel Cinematic Universe. After years of Marvel Studios building up the Avengers, the Fox deal put the company in a position to start telling stories about the characters who ushered in t...",
    "content": "When Disney acquired 21st Century Fox in 2019, you could see flashes of the studio's plan to further expand the Marvel Cinematic Universe. After years of Marvel Studios building up the Avengers, the Fox deal put the company in a position to start telling stories about the characters who ushered in the modern superhero movie frenzy, like Blade and the X-Men. But it was a little odd to hear that Marvel also planned to make the Fantastic Four a major part of the MCU's future.\nEven though the Fantastic Four have always been prominent in Marvel's comics, the characters - created by Jack Kirby and Stan Lee - had never translated well to the big s …\nRead the full story at The Verge.",
    "source": "The Verge",
    "url": "https://www.theverge.com/movie-reviews/711370/fantastic-four-first-steps-review-marvel",
    "published_at": "2025-07-22T17:15:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.8551736
  },
  {
    "id": "77d7f68b9870db50864bdb25826be428",
    "title": "Microsoft’s new Intel-powered Surface Laptop 5G arrives in August",
    "summary": "Microsoft announced a new 5G version of its Surface Laptop today, which will start shipping on August 26th starting at $1,799.99. The Surface Laptop 5G is powered by Intel’s Core Ultra Series 2 processors, complete with an NPU capable of providing access to Microsoft’s latest Copilot Plus AI feature...",
    "content": "Microsoft announced a new 5G version of its Surface Laptop today, which will start shipping on August 26th starting at $1,799.99. The Surface Laptop 5G is powered by Intel’s Core Ultra Series 2 processors, complete with an NPU capable of providing access to Microsoft’s latest Copilot Plus AI features.\nThe Surface Laptop 5G is very similar to the existing 13.8-inch Surface Laptop 7 model, except Microsoft has made some internal changes to accommodate a 5G modem and support for a physical nano SIM on the side of the laptop, as well as eSIMs.\nThe base Surface Laptop 5G will be priced at $1,799, and ship with an Intel Core Ultra 5, 16GB of RAM, and 256GB of storage. The top of the range model will be priced at $2,699, and ship with Intel’s Core Ultra 7 processor, 32GB of RAM, and 1TB of storage. All models will ship in the Surface platinum silver color.\nMicrosoft says it hasn’t just dropped a modem into its Surface Laptop 5G, as the company has built a special antenna system that’s not hidden away in the base of the device. “At the heart of Surface Laptop 5G is a dynamic antenna system that continuously adapts to its environment,” explains Nancie Gaskill, general manager of the Surface business. This system uses six antennas that automatically adjust depending on how the laptop is being held or used.\n\n“This design required a new material, one that allows radio signals to pass through without impacting performance, while still delivering the durability, premium feel and lightness our customers are looking for,” Gaskill says. “We developed a custom multi-layered laminate that meets all of these needs, enabling reliable 5G performance without compromising portability or design.”\nMicrosoft has tested its 5G hardware with more than 100 mobile operators across 50-plus countries. The 5G support will allow this laptop to always be connected while on the go and also to act as a 5G mobile hotspot to share its connection with devices over Wi-Fi.\nThe Surface Laptop 5G is designed primarily for businesses, which will also get access to the latest Surface Laptop 13-inch and Surface Pro 12-inch models starting today.",
    "source": "The Verge",
    "url": "https://www.theverge.com/news/711278/microsoft-surface-laptop-5g-specs-release-date-pricing",
    "published_at": "2025-07-22T16:57:20",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.8557746
  },
  {
    "id": "f29e3efa83591fb0588c11fd32280c8f",
    "title": "Pixel 10 Pro looks a lot like the base model in leaked renders",
    "summary": "After sharing the first official leaked renders of the Pixel 10 yesterday, today Android Headlines has shared images of the 10 Pro too. It looks almost identical to the base model, but will apparently launch in a more muted set of colors. Android Headlines reports that the black and white finishes a...",
    "content": "After sharing the first official leaked renders of the Pixel 10 yesterday, today Android Headlines has shared images of the 10 Pro too. It looks almost identical to the base model, but will apparently launch in a more muted set of colors.\nAndroid Headlines reports that the black and white finishes are the familiar “Obsidian” and “Porcelain” that Google has used before. The grayish blue will apparently be called “Moonstone,” while the “Jade” green is the most colorful of the lot, with a subtle gold trim too.\nShortly after Android Headlines shared leaked images of the base Pixel 10 yesterday, Google responded with its own official reveal. We’re not expecting the same to happen again today, as closer inspection suggests that yesterday’s reveal appears to be of the Pro model already.\nWith the base Pixel 10 rumored to sport its own telephoto camera, it seems like both that and the Pixel 10 Pro will look almost identical, colors aside. But there is still one giveaway: the Pro-exclusive temperature sensor, the small dot below the flash. That’s present in the phone Google officially revealed, which strongly suggests that it’s actually the 10 Pro — not to mention the color in that image looks a lot like the “Moonstone” in today’s leaked renders.\n\n\n\n\n\n\n\nGoogle has already confirmed that it will reveal the Pixel 10 phones at an event on August 20th, when we’re expecting to see both these phones, along with a larger Pixel 10 Pro XL, a potentially dustproof Pixel 10 Pro Fold, and a Pixel Watch 4 with some battery upgrades.",
    "source": "The Verge",
    "url": "https://www.theverge.com/news/711580/google-pixel-10-pro-design-leak-colors-temperature-sensor",
    "published_at": "2025-07-22T16:54:12",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.8563428
  },
  {
    "id": "187f92ce69e04deddac4f2f0d83f9954",
    "title": "Microsoft says Chinese hacking groups are behind SharePoint attacks",
    "summary": "Some of the attacks that targeted organizations using an exploit in Microsoft’s SharePoint server platform over the last few days have been linked to hacking groups affiliated with the Chinese government, according to a new Microsoft security blog.  “As of this writing, Microsoft has observed two na...",
    "content": "Some of the attacks that targeted organizations using an exploit in Microsoft’s SharePoint server platform over the last few days have been linked to hacking groups affiliated with the Chinese government, according to a new Microsoft security blog. \n“As of this writing, Microsoft has observed two named Chinese nation-state actors, Linen Typhoon and Violet Typhoon, exploiting these vulnerabilities targeting internet-facing SharePoint servers,” Microsoft said on Tuesday. “In addition, we have observed another China-based threat actor, tracked as Storm-2603, exploiting these vulnerabilities. Investigations into other actors also using these exploits are still ongoing.”\nEye Security told BleepingComputer it’s identified 54 organizations that have been breached, including a private university and a private energy operator in California, and a federal government health organization. The Washington Post reports that anonymous sources working on the SharePoint intrusions said they’ve also identified that some attacks were connected to IP addresses inside China. \nMicrosoft released a patch update for SharePoint 2016 servers on Tuesday morning, and it has now patched all versions of SharePoint that are impacted by the zero-day exploit. Microsoft’s update says it has assessed “with high confidence” that threat actors will continue using it to attack unpatched server systems now that it’s widely known. The vulnerability, which researchers at Eye Security published details about last week, allows hackers to access certain on-premises versions of SharePoint to steal sensitive data, harvest passwords, and move across connected services.",
    "source": "The Verge",
    "url": "https://www.theverge.com/news/711522/microsoft-sharepoint-exploit-china-based-hackers",
    "published_at": "2025-07-22T16:13:36",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.8592298
  },
  {
    "id": "8e4c7ec9d3cd8633f6e2909c174c6c50",
    "title": "The best AirPods to buy",
    "summary": "Whether you’re buying your first pair of AirPods or replacing a well-used older pair, it’s easy to understand why so many iPhone owners prefer Apple’s earbuds and headphones over other options. Apple has spent years gradually adding new features that work best — and sometimes only work at all — with...",
    "content": "Whether you’re buying your first pair of AirPods or replacing a well-used older pair, it’s easy to understand why so many iPhone owners prefer Apple’s earbuds and headphones over other options. Apple has spent years gradually adding new features that work best — and sometimes only work at all — within the company’s walled garden. These convenient tricks include audio sharing, automatic switching between Apple’s various devices, Apple TV integration, and more. \nThere are currently four AirPods models to choose from, each with its own distinct appeal and upside. You likely already know whether you’re more interested in earbuds or over-ear headphones, so that’s the first divide. In the case of headphones, your only choice is the AirPods Max. But in the earbuds category, Apple offers three options: the AirPods Pro, AirPods 4 with Active Noise Cancellation, and the plain old AirPods 4. \n\n\nThe best AirPods overallThe best if you don’t find ear tips comfortableThe best for those who prefer headphones\n\nThe best AirPods overall\nApple AirPods Pro (second-gen) with USB-C charging case\n\nScore: 8ProsConsMuch better noise cancellationImproved sound quality and clarityUnrivaled hearing health featuresUnchanged designSound is better but not top tier\nWhere to Buy: $249 $169 at Amazon $249 $169 at Walmart $249.99 at Best Buy\nIf you want the earbuds that guarantee you’ll get the latest and greatest software features from Apple, the second-generation AirPods Pro should be at the top of your list. They offer the whole gamut of ecosystem exclusives. And if you’re the type of person to misplace things, you’ll be thankful that the earbuds’ case has a U1 chip for pinpoint location finding. So whenever they go missing, you can track right where they are in the room using Apple’s Find My app.\nThe AirPods Pro deliver noise cancellation that’s effective at tamping down the volume of your surroundings in all but the most hectic environments. Their sound quality is on another level compared to the regular AirPods — helped in no small part by the in-ear seal you get from their silicone ear tips. \nIn 2024, Apple introduced three major hearing health features, including a hearing test, automatic hearing protection, and the option to use the AirPods Pro as clinical-grade hearing aids if you have mild or moderate hearing loss. No other AirPods (including the AirPods Max) offer this functionality, so it definitely sets the Pros apart. And the same can be said of their volume controls; you just swipe on the stems to raise or lower the loudness of your music, which is a handy advantage that the similar-looking AirPods 4 lack. \nRead our full AirPods Pro 2 review.\nThe best if you don’t find ear tips comfortable\nApple AirPods 4\n\nScore: 7ProsConsUpgraded sound qualityVoice isolation can noticeably improve call clarityDeep Apple ecosystem integrationNo wireless chargingNo built-in speaker on the caseNo proper multipoint\nWhere to Buy: $129.99 $119 at Amazon $129 $119 at Walmart $129.99 at Best Buy\nBut not everyone likes the way ear tips feel. Even with venting and the other measures Apple has taken to improve comfort and reduce that clogged-up sensation, some people just prefer the regular, one-size-fits-most AirPods. Their open design means you’re never cut off from the outside world. The AirPods Pro have an impressive transparency mode, but the AirPods 4 don’t need to pipe in your surroundings; you can always hear what’s happening around you.\nApple sells two versions of the AirPods 4. No matter which you choose, you’ll get the same sound quality, microphone performance on voice calls, and IP54 water resistance. (The latter also applies to the latest AirPods Pro.) The more expensive pair features active noise cancellation and a more advanced charging case. You might be surprised by how well the noise cancellation works even with an unsealed design; it reduces office ambience and annoying hums, but louder sounds and voices still cut through the ANC. As for the case, the pricier AirPods 4 include wireless charging and Find My integration.\nIf you’re truly interested in noise-canceling earbuds, consider saving a bit more and upgrading to the AirPods Pro 2. They offer much better audio quality, stronger ANC, and a better experience overall. I’d only steer you to the noise-canceling AirPods 4 if you’re really opposed to ear tips. \nRead my full AirPods 4 review.\nThe best for those who prefer headphones\nAirPods Max (USB-C)\n\nScore: 8.5ProsConsHigh-luxury designTerrific, balanced sound qualityVery effective noise cancellationDependable and foolproof controlsSpatial audio for immersive entertainmentHeavier than many competitorsNo 3.5mm jackWired listening requires $35 cableCase is an abominationLacks latest AirPods Pro features\nWhere to Buy: $549 $449.99 at Amazon $549.99 $449.99 at Walmart $549.99 $449.99 at Best Buy\nI’ve gone back and forth recommending Apple’s $549 AirPods Max over the last few years. They have a standout design, but the good looks and premium feel come at the cost of weight. These headphones are considerably heavier than most competitors and can get fatiguing over extended use. But Apple has also made smart choices: the fabric ear cups on the AirPods Max are much more pleasant in warm weather than the pleather you’ll find on Bose and Sony products, and won’t get your ears sweaty. \nThe AirPods Max provide impressive noise cancellation, and the transparency mode is clearer and more natural-sounding than any other set of headphones on the market. As for sound, Apple’s headphones have a pleasant sound signature that works well across a wide range of genres. They’re easy to listen to with an impressive soundstage for closed-back headphones. \nYou lose some features — like conversation awareness and adaptive audio — that are included on the AirPods Pro; this is a side effect of the AirPods Max using Apple’s older H1 chip. However, the company has recently added lossless audio over USB-C, meaning these headphones offer the richest audio fidelity of the entire lineup. \nRead my full AirPods Max (Lightning) review.\n\nHow we test AirPods\nWe spend dozens of hours using AirPods products for our initial reviews, and that testing extends for weeks and months afterward. That’s where we assess sound quality, mic performance, and overall reliability. Where applicable, we try the active noise cancellation in a wide range of different environments and have put the hearing protection of the AirPods Pro through the paces at concerts. We also closely examine ecosystem benefits and how the AirPods and Apple’s other products work together.\n\nUpdate, July 22nd: Adjusted prices / availability and added a link to a recent Favorites article.",
    "source": "The Verge",
    "url": "https://www.theverge.com/tech/645217/best-apple-airpods-pro",
    "published_at": "2025-07-22T15:21:29",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.863234
  },
  {
    "id": "cd8e09d944767e37c186aeb99cf42cf6",
    "title": "Honda and Acura EV owners can now use Tesla Superchargers",
    "summary": "Honda has launched a new EV charging adapter that will allow its all-electric Prologue and Acura ZDX to power up at over 23,500 Tesla Supercharger stations. The $225 adapter lets vehicles equipped with Combined Charging System (CCS) plugs use Tesla’s North American Charging Standard (NACS) stations,...",
    "content": "The 2024 Honda Prologue.\t\n\nHonda has launched a new EV charging adapter that will allow its all-electric Prologue and Acura ZDX to power up at over 23,500 Tesla Supercharger stations. The $225 adapter lets vehicles equipped with Combined Charging System (CCS) plugs use Tesla’s North American Charging Standard (NACS) stations, buying Honda some time before it officially builds an NACS into an EV.\nHonda first announced that it was working on the new adapter in March, and now drivers can purchase it from the automaker’s website, as well as from Honda and Acura dealerships. In addition to launching the adapter, Honda announced that it will now let EV owners use their vehicles’ built-in Google Maps app to find Tesla Superchargers.\n\nFollowing the standardization of the NACS in 2023, several major automakers like Honda committed to adopting the NACS plug. Honda is also working with BMW, GM, Hyundai, Kia, Mercedes-Benz, and Stellantis to build a network of EV chargers throughout North America, with support for both NACS and CCS.\nHonda is working on an integration with the HondaLink and Acura EV apps that will let drivers use Superchargers. For now, Honda Prologue and Acura ZDX owners will need to rely on Tesla’s app to initiate charging.",
    "source": "The Verge",
    "url": "https://www.theverge.com/news/711472/honda-acura-ev-tesla-supercharger-access-adapter",
    "published_at": "2025-07-22T15:11:31",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.8651066
  },
  {
    "id": "b08bd1c04af386d11582f784f3adf4bf",
    "title": "The Verge Launches New Site Features Aimed at Deepening Audience Engagement and Announces New Editorial Newsletters",
    "summary": "NEW YORK, NY (July 22, 2025) - The Verge today launched a suite of homepage and editorial product updates aimed at deepening its direct relationship with readers. The announcement includes a new feature that allows readers to follow topics and individual Verge journalists, view those stories in a pe...",
    "content": "NEW YORK, NY (July 22, 2025) - The Verge today launched a suite of homepage and editorial product updates aimed at deepening its direct relationship with readers. The announcement includes a new feature that allows readers to follow topics and individual Verge journalists, view those stories in a personalized feed on the homepage, and receive them via a daily digest email. Over the next month, the site will also launch several new editorial newsletters: a daily free flagship newsletter to give readers even more options for how they access The Verge, and multiple subscriber-exclusive offerings that will join Alex Heath's Command Line and Tom  …\nRead the full story at The Verge.",
    "source": "The Verge",
    "url": "https://www.theverge.com/press-room/710921/verge-site-features-launch-newsletters",
    "published_at": "2025-07-22T14:55:32",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.8661842
  },
  {
    "id": "e6a8b719ee192a741926a731530436b5",
    "title": "The Verge is getting way more personal with following feeds",
    "summary": "I've probably written a thousand stories for this website about our favorite apps adding new features, so it's a fun change of pace to be writing one about ourselves doing the same thing. Today, The Verge is adding some exciting new features that will let you personalize exactly how you read the sit...",
    "content": "I've probably written a thousand stories for this website about our favorite apps adding new features, so it's a fun change of pace to be writing one about ourselves doing the same thing. Today, The Verge is adding some exciting new features that will let you personalize exactly how you read the site. You'll be able to follow individual topics and authors, then read them in a custom homepage feed and through a daily email digest that's specific to you.\nOn the front page, you'll now see a toggle that says \"Following\" at the top of our news feed. Click it, and you'll be able to start choosing the topics you want to populate your own custom fe …\nRead the full story at The Verge.",
    "source": "The Verge",
    "url": "https://www.theverge.com/bulletin/710925/the-verge-is-getting-way-more-personal-with-following-feeds",
    "published_at": "2025-07-22T14:55:25",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.8667727
  },
  {
    "id": "72d55f97be282d7069b50263c5e64efb",
    "title": "Pokémon Legends: Z-A has a detailed new trailer and Switch 2 bundle",
    "summary": "Today’s Pokémon Presents livestream was short but definitely not light on announcements. There’s a new Pokémon puzzle game out right now. Pokémon Concierge season 2 has a release date. And on top of a new trailer for Pokémon Legends: Z-A, there’s a new Switch 2 bundle featuring the game, too. The — ...",
    "content": "Today’s Pokémon Presents livestream was short but definitely not light on announcements. There’s a new Pokémon puzzle game out right now. Pokémon Concierge season 2 has a release date. And on top of a new trailer for Pokémon Legends: Z-A, there’s a new Switch 2 bundle featuring the game, too.\nThe — and you’re going to want to sit down for this, since the name is apocalyptically long — Nintendo Switch 2 + Pokémon Legends: Z-A – Nintendo Switch 2 Edition bundle will be available on October 16th for $499. You’ll be able to preorder it from participating retailers soon, and hopefully there will be enough stock (unlike at launch). \n\nIf you’ve been waiting for more information on Pokémon Legends: Z-A before committing to the new console, then you’re in luck. We got a new trailer that reveals some of the details of the game’s story and events. In Lumiose City, you’ll unravel the mystery of rogue Mega Evolved Pokémon that are wreaking havoc. To do that, you’ll need your own Mega Pokémon, including the new Mega Dragonite that looks like a goober with wings coming out of its head. You’ll be able to discover more Mega Evolutions when the game launches on both Nintendo Switch systems on October 16th.",
    "source": "The Verge",
    "url": "https://www.theverge.com/games/711445/pokemon-legends-z-a-nintendo-switch-2-bundle-trailer",
    "published_at": "2025-07-22T14:48:24",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.8674622
  },
  {
    "id": "128d5f61b3ae8426d54dd861931ef867",
    "title": "A daily Pokémon puzzle game is out now as part of a busy lineup",
    "summary": "There’s a lot going on in the world of Pokémon — and you can play at least one of them right now. During its latest Pokémon Presents presentation, The Pokémon Company surprise launched Pokémon Friends, a puzzle game with daily challenges, an increasingly common style of game. In a cute Pokémon twist...",
    "content": "There’s a lot going on in the world of Pokémon — and you can play at least one of them right now. During its latest Pokémon Presents presentation, The Pokémon Company surprise launched Pokémon Friends, a puzzle game with daily challenges, an increasingly common style of game. In a cute Pokémon twist, solving puzzles earns you adorable (virtual) plushies you can use to decorate a room. It’s out today on iOS, Android, and the Nintendo Switch.\nElsewhere, we also got looks at a pair of animated adaptations of the franchise. That includes the soothing Netflix series Pokémon Concierge, which is getting a second season on September 4th…\n\nAnd Pokémon Tales: The Misadventures of Sirfetch’d & Pichu, a stop-motion series from a previously announced collaboration with Wallace & Gromit studio Aardman. It won’t be premiering until 2027, however.\n\nIt’s shaping up to be a big year for the franchise, as it will also be making its debut on the Switch 2 with Pokémon Legends: Z-A, which will be a cross-gen title available on both versions of the Switch when it launches on October 16th. As part of today’s presentation, we got a pair of new trailers, focused on the new location Lumiose City and all the various things players can get up to there.\nMeanwhile, there are some notable updates to some of the franchise’s many mobile spinoffs, including Mega Evolutions coming to the trading card game as part of an expansion in September, and a new area coming to Pokémon Sleep in November. And lastly, The Pokémon Company confirmed that the battle-focused spinoff Pokémon Champions will be launching in 2026. It’ll be on both mobile and the Switch.",
    "source": "The Verge",
    "url": "https://www.theverge.com/news/710734/pokemon-presents-july-2025-trailer-roundup",
    "published_at": "2025-07-22T13:51:58",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205397.8683856
  },
  {
    "id": "c1a93770b67b82105f1a4716dfd103fd",
    "title": "Crowdstrike’s massive cyber outage 1-year later: lessons enterprises can learn to improve security",
    "summary": "The incident's legacy extends far beyond CrowdStrike. Organizations now implement staged rollouts and maintain manual override capabilities.",
    "content": "The incident's legacy extends far beyond CrowdStrike. Organizations now implement staged rollouts and maintain manual override capabilities.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/security/how-crowdstrikes-78-minute-outage-reshaped-enterprise-cybersecurity/",
    "published_at": "2025-07-21T22:46:41",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205398.7926514
  },
  {
    "id": "409e752dac7be22b6d1480f1b6ac32e4",
    "title": "Google DeepMind makes AI history with gold medal win at world’s toughest math competition",
    "summary": "Google DeepMind's Gemini AI won a gold medal at the International Mathematical Olympiad by solving complex math problems using natural language, marking a breakthrough in AI reasoning and human-level performance.",
    "content": "Google DeepMind's Gemini AI won a gold medal at the International Mathematical Olympiad by solving complex math problems using natural language, marking a breakthrough in AI reasoning and human-level performance.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/google-deepmind-makes-ai-history-with-gold-medal-win-at-worlds-toughest-math-competition/",
    "published_at": "2025-07-21T22:33:34",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205398.7941911
  },
  {
    "id": "62e0e4f058a1251804a2c487110b2aaf",
    "title": "Chinese startup Manus challenges ChatGPT in data visualization: which should enterprises use?",
    "summary": "While Manus handles messy data better than ChatGPT, neither tool is yet ready for boardroom-ready slides.",
    "content": "While Manus handles messy data better than ChatGPT, neither tool is yet ready for boardroom-ready slides.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/data-infrastructure/chinese-startup-manus-challenges-chatgpt-in-data-visualization-which-should-enterprises-use/",
    "published_at": "2025-07-21T21:38:23",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205398.7949095
  },
  {
    "id": "d5404261263332bb0fb1f6b24323aaeb",
    "title": "A ChatGPT ‘router’ that automatically selects the right OpenAI model for your job appears imminent",
    "summary": "Like going to the supermarket and staring at aisles of cereal and sauces, the average ChatGPT user is currently faced with an overabundance.",
    "content": "Like going to the supermarket and staring at aisles of cereal and sauces, the average ChatGPT user is currently faced with an overabundance.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/a-chatgpt-router-that-automatically-selects-the-right-openai-model-for-your-job-appears-imminent/",
    "published_at": "2025-07-21T21:26:57",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205398.79542
  },
  {
    "id": "a744ecf4d939f845c44a26cdf7d61970",
    "title": "Weaving reality or warping it? The personalization trap in AI systems",
    "summary": "Each of our versions of reality is changing with AI. This could erode our ability to agree on basic facts or navigate shared challenges.",
    "content": "Each of our versions of reality is changing with AI. This could erode our ability to agree on basic facts or navigate shared challenges.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/weaving-reality-or-warping-it-the-personalization-trap-in-ai-systems/",
    "published_at": "2025-07-20T18:30:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205398.7957065
  },
  {
    "id": "81ffc33d6d84984df101d8103e01c67a",
    "title": "Author Correction: Early versus deferred use of CDK4/6 inhibitors in advanced breast cancer",
    "summary": "Nature, Published online: 22 July 2025; doi:10.1038/s41586-025-09406-zAuthor Correction: Early versus deferred use of CDK4/6 inhibitors in advanced breast cancer",
    "content": "Nature, Published online: 22 July 2025; doi:10.1038/s41586-025-09406-zAuthor Correction: Early versus deferred use of CDK4/6 inhibitors in advanced breast cancer",
    "source": "Nature",
    "url": "https://www.nature.com/articles/s41586-025-09406-z",
    "published_at": "2025-07-22T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205401.75124
  },
  {
    "id": "9f206bd6b9cb21ab3a9c038cd1959b33",
    "title": "Author Correction: Stress dynamically modulates neuronal autophagy to gate depression onset",
    "summary": "Nature, Published online: 22 July 2025; doi:10.1038/s41586-025-09404-1Author Correction: Stress dynamically modulates neuronal autophagy to gate depression onset",
    "content": "Nature, Published online: 22 July 2025; doi:10.1038/s41586-025-09404-1Author Correction: Stress dynamically modulates neuronal autophagy to gate depression onset",
    "source": "Nature",
    "url": "https://www.nature.com/articles/s41586-025-09404-1",
    "published_at": "2025-07-22T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205401.7514093
  },
  {
    "id": "ddc8ba5599ff3312068171ab3267fdef",
    "title": "A natural nuclear reactor",
    "summary": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-02138-0Questions raised by a fission chain reaction that occurred billions of years ago, and making silver compounds lighter with light, in our weekly dip into Nature’s archive.",
    "content": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-02138-0Questions raised by a fission chain reaction that occurred billions of years ago, and making silver compounds lighter with light, in our weekly dip into Nature’s archive.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02138-0",
    "published_at": "2025-07-22T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205401.7516158
  },
  {
    "id": "f526473efd8b0c979668b7d73dc5aa3f",
    "title": "Why publishing referee reports could backfire on public trust",
    "summary": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-02317-zWhy publishing referee reports could backfire on public trust",
    "content": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-02317-zWhy publishing referee reports could backfire on public trust",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02317-z",
    "published_at": "2025-07-22T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205401.751776
  },
  {
    "id": "ab7cd4a59ffe48b7a77f59520057e6b7",
    "title": "Encouraging a ‘data sufficiency’ mindset is key for responsible research",
    "summary": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-02318-yEncouraging a ‘data sufficiency’ mindset is key for responsible research",
    "content": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-02318-yEncouraging a ‘data sufficiency’ mindset is key for responsible research",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02318-y",
    "published_at": "2025-07-22T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205401.751924
  },
  {
    "id": "8a8773adbd52c3f9b584cf6279309e2f",
    "title": "Brazil must not weaken environmental planning rules",
    "summary": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-02319-xBrazil must not weaken environmental planning rules",
    "content": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-02319-xBrazil must not weaken environmental planning rules",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02319-x",
    "published_at": "2025-07-22T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205401.7520764
  },
  {
    "id": "2fc09afe713f6afc9c1859c2a71378d0",
    "title": "The optimistic brain: scans reveal thought patterns shared by positive thinkers",
    "summary": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-02302-6Insights from brain imaging could have implications for mental-health research.",
    "content": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-02302-6Insights from brain imaging could have implications for mental-health research.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02302-6",
    "published_at": "2025-07-22T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205401.7525566
  },
  {
    "id": "2bfc7ce37c1f7a050b6ad524f93122bd",
    "title": "Breaking point: mechanical stress helps NINJ1 protein to rupture membranes",
    "summary": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-02130-8The protein NINJ1 enables cells to break open during certain types of cell death. Modulation of physical forces on the membrane reveals how NINJ1 acts.",
    "content": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-02130-8The protein NINJ1 enables cells to break open during certain types of cell death. Modulation of physical forces on the membrane reveals how NINJ1 acts.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02130-8",
    "published_at": "2025-07-22T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205401.7530806
  },
  {
    "id": "45299063c77d6d6862ef0017958206c8",
    "title": "The COVID-19 pandemic transformed this scientist into a research-integrity sleuth",
    "summary": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-01920-4Lonni Besançon has faced online abuse, threats and legal challenges. But he remains proud of his service to science and society.",
    "content": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-01920-4Lonni Besançon has faced online abuse, threats and legal challenges. But he remains proud of his service to science and society.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-01920-4",
    "published_at": "2025-07-22T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205401.7535834
  },
  {
    "id": "5b42004b381dc727075ab4fda148e0be",
    "title": "Fund scholars who tackle urgent issues — from misinformation to error spotting",
    "summary": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-02258-7Scientists who are not tied down by fixed research agendas can pivot nimbly to work where they are most needed. It’s time to build career paths with these researchers in mind.",
    "content": "Nature, Published online: 22 July 2025; doi:10.1038/d41586-025-02258-7Scientists who are not tied down by fixed research agendas can pivot nimbly to work where they are most needed. It’s time to build career paths with these researchers in mind.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02258-7",
    "published_at": "2025-07-22T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205401.7538664
  },
  {
    "id": "6e13f7c982268ddcc8550f90f37b622e",
    "title": "Can portable headsets peer into the minds of hunter-gatherers and other understudied populations?",
    "summary": "Science chats with health economist Shailender Swaminathan about how compact EEGs could reveal the impact of culture and environment on the brain",
    "content": "Science chats with health economist Shailender Swaminathan about how compact EEGs could reveal the impact of culture and environment on the brain",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/can-portable-headsets-peer-minds-hunter-gatherers-and-other-understudied-populations",
    "published_at": "2025-07-22T12:05:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205402.9160712
  },
  {
    "id": "bbaf143ea0ca7f1e06ec1c10a92223aa",
    "title": "Employees’ protests against Trump science policies spread to NSF",
    "summary": "Letter to key House Democrat follows declarations by scientists at NIH, EPA, and NASA",
    "content": "Letter to key House Democrat follows declarations by scientists at NIH, EPA, and NASA",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/employees-protests-against-trump-science-policies-spread-nsf",
    "published_at": "2025-07-22T12:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205402.9163668
  },
  {
    "id": "d06c36c57651a72623570a62b4cda104",
    "title": "Watch an earthquake split a hillside in two",
    "summary": "Footage of massive Myanmar temblor provides the first video evidence of earthquake ruptures",
    "content": "Footage of massive Myanmar temblor provides the first video evidence of earthquake ruptures",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/watch-earthquake-split-hillside-two",
    "published_at": "2025-07-22T11:10:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205402.9165683
  },
  {
    "id": "a3e260963b6c4a40e6b2162d0482dee4",
    "title": "Engineers transform dental floss into needle-free vaccine",
    "summary": "New method places inactivated viruses directly into mice’s gums",
    "content": "New method places inactivated viruses directly into mice’s gums",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/engineers-transform-dental-floss-needle-free-vaccine",
    "published_at": "2025-07-22T05:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205402.9168086
  },
  {
    "id": "415925b0bdcf71c61f7ac4e57d590f37",
    "title": "Octopuses fall for the ‘rubber arm’ illusion, just like us",
    "summary": "Experiment shows octopuses feel body ownership, a trait previously seen only in mammals",
    "content": "Experiment shows octopuses feel body ownership, a trait previously seen only in mammals",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/octopuses-fall-rubber-arm-illusion-just-us",
    "published_at": "2025-07-21T04:20:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205402.9169116
  },
  {
    "id": "c300d90e9e32f8dc8564d54ff71156da",
    "title": "Insect X-Men: Helmets help these odd bugs sense electric fields",
    "summary": "Ability may help treehoppers distinguish friend from foe",
    "content": "Ability may help treehoppers distinguish friend from foe",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/insect-x-men-helmets-help-these-odd-bugs-sense-electric-fields",
    "published_at": "2025-07-21T03:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205402.9170015
  },
  {
    "id": "8288492222455edac760c9410f6e16b6",
    "title": "Storing hydrogen in oil-like liquid could allow easy transport in trucks and ships",
    "summary": "Cheap catalyst could improve global access to costly green fuel",
    "content": "Cheap catalyst could improve global access to costly green fuel",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/storing-hydrogen-oil-liquid-could-allow-easy-transport-trucks-and-ships",
    "published_at": "2025-07-21T02:30:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205402.9170983
  },
  {
    "id": "c630596cf9160fcf0f5a68979f2f1db7",
    "title": "Betelgeuse’s long-predicted stellar companion may have been found at last",
    "summary": "Small star could crash into red supergiant in the next 10,000 years",
    "content": "Small star could crash into red supergiant in the next 10,000 years",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/betelgeuse-s-long-predicted-stellar-companion-may-have-been-found-last",
    "published_at": "2025-07-21T02:10:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753205402.917327
  },
  {
    "id": "8d85815142202ff258adec2029e83438",
    "title": "Revolutionary AI Breakthrough in Local Processing",
    "summary": "Researchers achieve significant improvements in on-device AI processing, enabling faster and more private artificial intelligence applications.",
    "content": "A team of researchers has developed new techniques for optimizing AI models to run efficiently on local devices, reducing the need for cloud processing and improving user privacy. The breakthrough includes novel quantization methods and hardware acceleration techniques.",
    "source": "Mock_News",
    "url": "https://example.com/article/technology/0",
    "published_at": "2025-07-23T00:44:20.356597",
    "category": "technology",
    "language": "en",
    "importance": 0.9,
    "processed_at": 1753206260.3566597
  },
  {
    "id": "6ad8e9ee2c7f0fd11ca2763a3cfafd6e",
    "title": "Voice AI Systems Reach Human-Level Understanding",
    "summary": "Latest voice recognition and response systems demonstrate unprecedented accuracy in natural language understanding and generation.",
    "content": "Modern voice assistant technology has achieved remarkable milestones in understanding context, emotion, and nuanced human communication, making interactions more natural and helpful than ever before.",
    "source": "Mock_News",
    "url": "https://example.com/article/technology/1",
    "published_at": "2025-07-22T23:44:20.356696",
    "category": "technology",
    "language": "en",
    "importance": 0.8,
    "processed_at": 1753206260.356705
  },
  {
    "id": "fd3dc1c4af0a83628f139fd6472286cb",
    "title": "Quantum Computing Achieves New Stability Record",
    "summary": "Scientists maintain quantum coherence for record-breaking duration, bringing practical quantum computers closer to reality.",
    "content": "A breakthrough in quantum error correction and coherence maintenance has been achieved, with quantum states remaining stable for over 100 seconds under controlled conditions.",
    "source": "Mock_News",
    "url": "https://example.com/article/science/0",
    "published_at": "2025-07-23T00:44:20.356714",
    "category": "science",
    "language": "en",
    "importance": 0.8,
    "processed_at": 1753206260.3567173
  },
  {
    "id": "a01785239142554ec479b76ae68718e1",
    "title": "OneXSugar: Playing with the first dual-screen transforming handheld",
    "summary": "I can't believe they're actually making these, was my very first thought, as I powered on a working prototype of the OneXSugar Sugar 1. This week, One-Netbook is crowdfunding a gaming handheld on Indiegogo like none I've ever touched before. It's got two OLED touchscreens, two power buttons, two set...",
    "content": "I can't believe they're actually making these, was my very first thought, as I powered on a working prototype of the OneXSugar Sugar 1.\nThis week, One-Netbook is crowdfunding a gaming handheld on Indiegogo like none I've ever touched before. It's got two OLED touchscreens, two power buttons, two sets of volume controls, and two hinged rotating gamepads that let it transform into entirely different modes. \nFolded down, it's like a Nintendo Switch, with a single 6-inch screen flanked by half-gamepads. Pop open the 3.92-inch secondary screen and rotate the gamepads, and it's like a Nintendo DS with one screen on top of the other! Whichever mo …\nRead the full story at The Verge.",
    "source": "The Verge",
    "url": "https://www.theverge.com/report/711116/onexsugar-sugar-1-hands-on-preview-transforming-dual-screen",
    "published_at": "2025-07-22T17:17:09",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753206256.3823588
  },
  {
    "id": "36847f47ba627a9ff32e7805ef747130",
    "title": "The 21 Best Movies on Amazon Prime Right Now (August 2025)",
    "summary": "Deep Cover, Heads of State, and Challengers are just a few of the movies you should be watching on Amazon Prime Video this week.",
    "content": "Deep Cover, Heads of State, and Challengers are just a few of the movies you should be watching on Amazon Prime Video this week.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/best-amazon-prime-movies/",
    "published_at": "2025-07-26T11:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.3024306
  },
  {
    "id": "7e3bc40410c22d68276a039d69a0f14e",
    "title": "The Texas Floods Were a Preview of What’s to Come",
    "summary": "Mounting evidence shows no US state is safe from the flooding that ravaged Texas’ Kerr Country.",
    "content": "Mounting evidence shows no US state is safe from the flooding that ravaged Texas’ Kerr Country.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/kerr-countys-tragic-flood-wasnt-an-outlier-it-was-a-preview/",
    "published_at": "2025-07-26T11:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.302505
  },
  {
    "id": "2996d6829ea4f4bcdbe0870eb63060d0",
    "title": "Do You Need a Barbecue Knife?",
    "summary": "These specialty blades—cutlass-shaped mini machetes made for chopping grilled and smoked meats—aren’t a necessary addition to your grill game. But they’re fun, and they get the job done.",
    "content": "These specialty blades—cutlass-shaped mini machetes made for chopping grilled and smoked meats—aren’t a necessary addition to your grill game. But they’re fun, and they get the job done.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/do-you-need-a-barbecue-knife/",
    "published_at": "2025-07-26T10:30:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.302567
  },
  {
    "id": "a98b4dedc1460652753d2bc4312d0f5a",
    "title": "60 Italian Mayors Want to Be the Unlikely Solution to Self-Driving Cars in Europe",
    "summary": "A network of local officials in Italy want to turn their cities into laboratories for the vehicles of tomorrow in the hope of catching up with the US and China.",
    "content": "A network of local officials in Italy want to turn their cities into laboratories for the vehicles of tomorrow in the hope of catching up with the US and China.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/60-italian-mayors-want-to-be-the-unlikely-solution-to-self-driving-cars-in-europe/",
    "published_at": "2025-07-26T10:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.3026252
  },
  {
    "id": "95bdd6dc89292bea73faa3c67b879db4",
    "title": "Gear News of the Week: Amazon Buys Bee, VSCO Has a New App, and CMF Debuts a Smartwatch",
    "summary": "Plus: Google Photos lets you convert images to videos, Microsoft has a 5G Surface, and Palmer Luckey asks if you’d buy a US-made laptop.",
    "content": "Plus: Google Photos lets you convert images to videos, Microsoft has a 5G Surface, and Palmer Luckey asks if you’d buy a US-made laptop.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/gear-news-of-the-week-amazon-buys-bee-vsco-has-a-new-app-and-cmf-debuts-a-smartwatch/",
    "published_at": "2025-07-26T09:32:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.302684
  },
  {
    "id": "670cb39959e8dea2bb09c98858413eae",
    "title": "Tesla Readies a Taxi Service in San Francisco—but Not With Robotaxis",
    "summary": "The electric car maker informed California that it will operate a limited public taxi service. But it’s not legally allowed to do this with self-driving cars.",
    "content": "The electric car maker informed California that it will operate a limited public taxi service. But it’s not legally allowed to do this with self-driving cars.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/tesla-robotaxi-san-francisco-bay-area/",
    "published_at": "2025-07-25T21:26:14",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.3027403
  },
  {
    "id": "f2795510c7241fad90dca41d1bc2b365",
    "title": "Join Our Next Livestream: Inside Katie Drummond’s Viral Interview With Bryan Johnson",
    "summary": "On July 31, WIRED’s global editorial director discusses the world of wellness—and beyond—with WIRED reporters.",
    "content": "On July 31, WIRED’s global editorial director discusses the world of wellness—and beyond—with WIRED reporters.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/inside-katie-drummonds-viral-interview-with-bryan-johnson/",
    "published_at": "2025-07-25T18:40:23",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.3028085
  },
  {
    "id": "7d52495debd2b2901d0731a0a9487d33",
    "title": "Trump’s Anti-Bias AI Order Is Just More Bias",
    "summary": "The Trump administration says it wants AI models free from ideological bias, as it pressures their developers to reflect the president’s worldview.",
    "content": "The Trump administration says it wants AI models free from ideological bias, as it pressures their developers to reflect the president’s worldview.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/trump-ai-order-bias-openai-google/",
    "published_at": "2025-07-25T15:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.3028765
  },
  {
    "id": "2c6b057ae05597f1c2656a0c22fb1310",
    "title": "The Best Samsung Phones of 2025, Tested and Reviewed",
    "summary": "From flagship and budget to flipping and folding, Samsung’s Galaxy range spans the breadth of the smartphone cosmos. WIRED’s here to help you make your choice.",
    "content": "From flagship and budget to flipping and folding, Samsung’s Galaxy range spans the breadth of the smartphone cosmos. WIRED’s here to help you make your choice.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/gallery/best-samsung-phones/",
    "published_at": "2025-07-25T13:03:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.3029346
  },
  {
    "id": "7972863255908e5562d17c1cd3925df4",
    "title": "Somnee Smart Sleep Headband Review: High-Tech Help",
    "summary": "This wearable tech maps your brain using EEG sensors and algorithms, delivering therapeutic stimulation to improve sleep. And it succeeds, sort of.",
    "content": "This wearable tech maps your brain using EEG sensors and algorithms, delivering therapeutic stimulation to improve sleep. And it succeeds, sort of.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/review/somnee-sleep-headband/",
    "published_at": "2025-07-25T12:31:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.3029878
  },
  {
    "id": "804bc2b08dd5c5666665692ca26b127c",
    "title": "Microsoft to stop using China-based teams to support Department of Defense",
    "summary": "The tech giant has relied on global workforce to support federal clients.",
    "content": "Last week, Microsoft announced that it would no longer use China-based engineering teams to support the Defense Department’s cloud computing systems, following ProPublica’s investigation of the practice, which cybersecurity experts said could expose the government to hacking and espionage.\nBut it turns out the Pentagon was not the only part of the government facing such a threat. For years, Microsoft has also used its global workforce, including China-based personnel, to maintain the cloud systems of other federal departments, including parts of Justice, Treasury and Commerce, ProPublica has found.\nThis work has taken place in what’s known as the Government Community Cloud, which is intended for information that is not classified but is nonetheless sensitive. The Federal Risk and Authorization Management Program, the US government’s cloud accreditation organization, has approved GCC to handle “moderate” impact information “where the loss of confidentiality, integrity, and availability would result in serious adverse effect on an agency’s operations, assets, or individuals.”Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/security/2025/07/microsoft-to-stop-using-china-based-teams-to-support-department-of-defense/",
    "published_at": "2025-07-26T11:00:21",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.7305996
  },
  {
    "id": "48de1bb99b5d31d536274373142facb7",
    "title": "This aerogel and some sun could make saltwater drinkable",
    "summary": "Previous aerogels didn't work on a scale that was large enough to matter.",
    "content": "Earth is about 71 percent water. An overwhelming 97 percent of that water is found in the oceans, leaving us with only 3 percent in the form of freshwater—and much of that is frozen in the form of glaciers. That leaves just 0.3 percent of that freshwater on the surface in lakes, swamps, springs, and our main sources of drinking water, rivers and streams.\nDespite our planet’s famously blue appearance from space, thirsty aliens would be disappointed. Drinkable water is actually pretty scarce.\nAs if that doesn’t already sound unsettling, what little water we have is also threatened by climate change, urbanization, pollution, and a global population that continues to expand. Over 2 billion people live in regions where their only source of drinking water is contaminated. Pathogenic microbes in the water can cause cholera, diarrhea, dysentery, polio, and typhoid, which could be fatal in areas without access to vaccines or medical treatment.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/science/2025/07/this-aerogel-and-some-sun-could-make-saltwater-drinkable/",
    "published_at": "2025-07-26T10:00:52",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.730907
  },
  {
    "id": "fb2ac319f2ef75039152eed86e0bcce7",
    "title": "After BlackSuit is taken down, new ransomware group Chaos emerges",
    "summary": "As BlackSuit's dark web site goes dark, Chaos is already around to pick up the slack.",
    "content": "Hot on the heels of a major ransomware group being taken down through an international law enforcement operation comes a new development that highlights the whack-a-mole nature of such actions: A new group, likely comprised of some of the same members, has already taken its place.\nThe new group calls itself Chaos, in recognition of the .chaos name extension its ransomware stamps on files it has encrypted and the “readme.chaos[.]txt” name given to ransom notes sent to victims. Researchers at Cisco’s Talos Security Group said Thursday that since Chaos emerged in February, it has engaged in “big-game hunting”—meaning attacks designed to extract hefty payments—that have mainly targeted organizations in the US and, to a lesser extent, the UK, New Zealand, and India. Talos said it recently observed the group demanding a ransom of about $300,000.\nWalking in your footsteps\nIn exchange for paying the demanded ransom, victims get a pinky swear that they’ll receive a decryptor and a detailed report of the vulnerabilities the group members found in the victim’s network and that the group will delete all the data in its possession. Victims who refuse to pay face the threat of never getting their data unlocked, having data publicly disclosed, and being subjected to distributed denial-of-service attacks.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/security/2025/07/after-blacksuit-is-taken-down-new-ransomware-group-chaos-emerges/",
    "published_at": "2025-07-26T00:21:30",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.731136
  },
  {
    "id": "e021ead2132f80fe19146b8f38bc6dbc",
    "title": "Starlink kept me connected to the Internet without fail—until Thursday",
    "summary": "\"Starlink went down across the entire front.\"",
    "content": "A rare global interruption in the Starlink satellite Internet network knocked subscribers offline for more than two hours on Thursday, the longest widespread outage since SpaceX opened the service to consumers nearly five years ago.\nThe outage affected civilian and military users, creating an inconvenience for many but cutting off a critical lifeline for those who rely on Starlink for military operations, health care, and other applications.\nMichael Nicolls, SpaceX's vice president of Starlink engineering, wrote on X that the network outage lasted approximately 2.5 hours.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/space/2025/07/starlink-kept-me-connected-to-the-internet-without-fail-until-thursday/",
    "published_at": "2025-07-25T22:17:23",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.7313316
  },
  {
    "id": "8e91d0d3282e60c6348cfd3437a691a4",
    "title": "North Korean hackers ran US-based “laptop farm” from Arizona woman’s home",
    "summary": "North Korea made millions from the scheme.",
    "content": "Christina Chapman, a 50-year-old Arizona woman, has just been sentenced to 102 months in prison for helping North Korean hackers steal US identities in order to get \"remote\" IT jobs with more than 300 American companies, including Nike. The scheme funneled millions of dollars to the North Korean state.\nWhy did Chapman do it? In a letter sent this week to the judge, Chapman said that she was \"looking for a job that was Monday through Friday that would allow me to be present for my mom\" who was battling cancer. (Her mother died in 2023.) But \"the area where we lived didn't provide for a lot of job opportunities that fit what I needed. I also thought that the job was allowing me to help others.\"\nShe offered her \"deepest and sincerest apologies to any person who was harmed by my actions,\" thanked the FBI for busting her, and said that when she gets out of prison, she hopes to \"pursue the books that I have been working on writing and starting my own underwear company.\"Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/security/2025/07/north-korean-hackers-ran-us-based-laptop-farm-from-arizona-womans-home/",
    "published_at": "2025-07-25T21:39:17",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.7315454
  },
  {
    "id": "caccb2964c7d5ad67b8513b1ea915404",
    "title": "Widely panned arsenic life paper gets retracted—15 years after brouhaha",
    "summary": "Opinions are mixed on the retraction, and the authors continue to defend their work.",
    "content": "In December 2010, a study led by a NASA astrobiology fellow claimed to have found an alien-like microbe in a salty, alkaline lake in California. This extraordinary bacterium could reportedly thrive using the toxic element arsenic in place of phosphorus—otherwise thought essential for life on Earth. It even incorporated arsenic, instead of phosphorus, into the backbone of its DNA, according to the study, which was published online by the prestigious journal Science.\nIf true, the claims were groundbreaking. And NASA's press team only hyped the potential significance. In press materials, the agency claimed the finding \"begs a rewrite of biology textbooks\" and \"will impact the search for evidence of extraterrestrial life.\" In a subsequent press conference, the lead author, Felisa Wolfe-Simon, didn't hold back, either, saying, \"We've cracked open the door to what's possible for life elsewhere in the universe and that's profound.\"\nBacklash\nBut upon that very splashy debut, outside scientists quickly identified flaws and problems in the study. When the study finally appeared in the June 3, 2011, print issue of Science, it was accompanied by eight \"technical comments\" blasting the study claims.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/science/2025/07/widely-panned-arsenic-life-paper-gets-retracted-15-years-after-brouhaha/",
    "published_at": "2025-07-25T20:26:44",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.7318442
  },
  {
    "id": "a006706cc301754d38d2f0aaae81d7cf",
    "title": "Echelon kills smart home gym equipment offline capabilities with update",
    "summary": "Update also blocks compatibility with popular third-party apps.",
    "content": "A firmware update has killed key functionality for Echelon smart home gym equipment that isn't connected to the Internet.\nAs explained in a Tuesday blog post by Roberto Viola, who develops the \"QZ (qdomyos-zwift)\" app that connects Echelon machines to third-party fitness platforms, like Peloton, Strava, and Apple HealthKit, the firmware update forces Echelon machines to connect to Echelon’s servers in order to work properly. A user online reported that as a result of updating his machine, it is no longer syncing with apps like QZ, and he is unable to view his machine's exercise metrics in the Echelon app without an Internet connection.\nAffected Echelon machines reportedly only have full functionality, including the ability to share real-time metrics, if a user has the Echelon app active and if the machine is able to reach Echelon’s servers. Viola wrote:Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/gadgets/2025/07/firmware-update-hinders-echelon-smart-home-gym-equipments-ability-to-work-offline/",
    "published_at": "2025-07-25T20:10:31",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.7322032
  },
  {
    "id": "50b501294013a0d3d4873fc1239db934",
    "title": "OpenAI’s most capable AI model, GPT-5, may be coming in August",
    "summary": "Sources say new model combines o3 reasoning with general GPT capabilities.",
    "content": "On Thursday, The Verge reported that OpenAI is preparing to launch GPT-5 as early as August, according to sources familiar with the company's plans. The report comes five months after CEO Sam Altman first laid out a roadmap for the next-generation AI model that would unify the company's various AI capabilities. OpenAI CEO Sam Altman revealed in a post on X last week that the company plans to release GPT-5 \"soon.\"\nAccording to The Verge's Tom Warren, Microsoft engineers began preparing server capacity for GPT-5 as early as late May, but testing and development challenges pushed the timeline back. During an appearance on Theo Von's podcast this week, Altman demonstrated the model's capabilities by having it answer a question he couldn't. \"I put it in the model, this is GPT-5, and it answered it perfectly,\" Altman said, saying it gave him a \"weird feeling\" to see the AI model answer a question that he couldn't.\nGPT-5 has been a highly anticipated release since the launch of GPT-4 in March 2023. In fact, we first wrote about rumors of GPT-5's launch in March 2024, but it appears that GPT-5 did not materialize last year because the company saved the \"GPT-5\" name for a future release.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/ai/2025/07/openais-most-capable-ai-model-gpt-5-may-be-coming-in-august/",
    "published_at": "2025-07-25T19:59:37",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.7325048
  },
  {
    "id": "f6033c369cc0fdd222c15d2e97f9ada1",
    "title": "Remembering Descent, the once-popular, fully 3D 6DOF shooter",
    "summary": "Descent is a big part of gaming history, but not many people talk about it.",
    "content": "I maintain a to-do list of story ideas to write at Ars, and for about a year \"monthly column on DOS games I love\" has been near the top of the list. When we spoke with the team at GOG, it felt less like an obligation and more like a way to add another cool angle to what I was already planning to do.\nI'm going to start with the PC game I played most in high school and the one that introduced me to the very idea of online play. That game is Descent.\nAs far as I can recall, Descent was the first shooter to be fully 3D with six degrees of freedom. It's not often in today's gaming world that you get something completely and totally new, but that's exactly what Descent was 30 years ago in 1995.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/gaming/2025/07/remembering-descent-the-once-popular-fully-3d-6dof-shooter/",
    "published_at": "2025-07-25T19:00:51",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.732813
  },
  {
    "id": "bb3032cb0a69403e27e99c8deeac2540",
    "title": "Delta’s AI spying to “jack up” prices must be banned, lawmakers say",
    "summary": "Lawmakers want to prevent companies from using AI to increase prices or lower wages.",
    "content": "One week after Delta announced it is expanding a test using artificial intelligence to charge different prices based on customers' personal data—which critics fear could end cheap flights forever—Democratic lawmakers have moved to ban what they consider predatory surveillance pricing.\nIn a press release, Reps. Greg Casar (D-Texas) and Rashida Tlaib (D-Mich.) announced the Stop AI Price Gouging and Wage Fixing Act. The law directly bans companies from using \"surveillance-based\" price or wage setting to increase their profit margins.\nIf passed, the law would allow anyone to sue companies found unfairly using AI, lawmakers explained in what's called a \"one-sheet.\" That could mean charging customers higher prices—based on \"how desperate a customer is for a product and the maximum amount a customer is willing to pay\"—or paying employees lower wages—based on \"their financial status, personal associations, and demographics.\"Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/tech-policy/2025/07/deltas-ai-spying-to-jack-up-prices-must-be-banned-lawmakers-say/",
    "published_at": "2025-07-25T18:13:52",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529498.733126
  },
  {
    "id": "b33cbfd40d03ebc038cad2be1f875d9b",
    "title": "GPD’s monster Strix Halo handheld requires a battery ‘backpack’ or a 180W charger",
    "summary": "Yesterday, I mentioned how GPD is teasing the most potent handheld yet made — a GPD Win 5 that will house the Ryzen AI Max+ 395 chip, with AMD’s most powerful integrated graphics yet, inside a PlayStation Vita-shaped machine. If you’ve been wondering how that huge chip could even fit, handheld exper...",
    "content": "Yesterday, I mentioned how GPD is teasing the most potent handheld yet made — a GPD Win 5 that will house the Ryzen AI Max+ 395 chip, with AMD’s most powerful integrated graphics yet, inside a PlayStation Vita-shaped machine.\nIf you’ve been wondering how that huge chip could even fit, handheld expert Cary “The Phawx” Golomb now has the answer: the 7-inch handheld will apparently have no internal battery taking up space. The Win 5 is designed to either be plugged into the wall, with a gaming laptop sized 180-watt charger providing the juice — or powered by a big 80 watt-hour external battery “backpack” that will (only? additionally?) be sold separately.\n\nBreaking news! The GPD WIN 5 is expected to make its debut at Chinajoy 2025 pic.twitter.com/G6cwqajspJ— GPD Game Consoles (@softwincn) July 24, 2025\n\nWe can see the full spec sheet for the new Win 5 in the Phawx’s video, and as he notes, GPD had to make its Win 5 larger than the Win 4 even before you add that backpack battery. \nWhile the Win 4 is a compact 6-inch handheld with a 45 watt-hour pack, the Win 5 with its 7-inch screen will be narrower but thicker than the Asus ROG Ally X handheld — which is an apt comparison, considering that handheld similarly pairs a 7-inch screen with an 80 watt-hour battery pack.\nHere, though, the battery will add extra girth: it’s roughly 4 inches (110mm) wide and tall, and 0.7 inches (18mm) deep; it’s not clear how it attaches yet, as GPD has only shared the one dark video of the Win 5 filmed from the front, but the spec sheet mentions a “Battery to Host Dedicated Connector” as an accessory, so it might require plugging in a cable.\nIf you’re curious what the handheld’s controls might look like in better light, I tried brightening it up:\n\nOther intriguing things we can see in the full spec sheet include:\n\nA 120Hz variable refresh rate screen, where the Win 4 was limited to 60Hz\nTwo configs: AMD Ryzen AI Max+ 395 (16C/32T/ Radeon 8060S) or AI Max 385 (8C/16T/ Radeon 8050S)\n32, 64, or even the full 128GB of unified memory AMD offers for these chips\nUSB-4 with 100W PD charging and 8K/60 DP output\nTwo fans and four heat pipes for cooling\nAn optional HDMI and USB dock with a “battery charging slot,” presumably for the external battery\nNo mention of any integrated keyboard, whereas previous Win devices had a hidden keyboard underneath a sliding screen\n\nYou can peruse the whole sheet at your leisure in the Phawx’s video or the screenshots we took from Phawx (with his permission) below. Be sure to tap a couple of times to make them large enough for full reading.",
    "source": "The Verge",
    "url": "https://www.theverge.com/news/714294/gpd-win-5-strix-halo-specs-revealed",
    "published_at": "2025-07-25T23:19:12",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529499.4698987
  },
  {
    "id": "704f52e20329a3bb31fb5af59450e0c0",
    "title": "DJI couldn’t confirm or deny it disguised this drone to evade a US ban",
    "summary": "DJI barely sells drones in the United States anymore. The shelves are bare; resellers are jacking up prices. It appears an unofficial ban at US customs is to blame. But on Amazon, you can now buy a drone that's a a dead ringer for the DJI Mini 4 Pro - the SkyRover X1 - for […]",
    "content": "DJI barely sells drones in the United States anymore. The shelves are bare; resellers are jacking up prices. It appears an unofficial ban at US customs is to blame. But on Amazon, you can now buy a drone that's a a dead ringer for the DJI Mini 4 Pro - the SkyRover X1 - for a reasonable $758. And that's probably because DJI made it happen.\nThere's evidence suggesting so, and DJI was not able to deny the SkyRover X1 was a DJI product one day after we reached out.\nAs reported by DroneXL, security researchers have discovered the SkyRover X1 not only has the same specs, features, and an incredibly similar app to the one DJI provides for its dro …\nRead the full story at The Verge.",
    "source": "The Verge",
    "url": "https://www.theverge.com/report/714103/dji-skyrover-x1-evade-ban-amazon",
    "published_at": "2025-07-25T20:43:21",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529499.4703157
  },
  {
    "id": "f879b3487807814adbcaf076dcf1a40a",
    "title": "Google gets its swag back",
    "summary": "This week, I take a look at the surprisingly strong state of Google, Meta gets a new chief AI researcher, and more. If you haven't already, be sure to check out this week's Decoder episode about deepfakes and where they are headed. Also, do you use an AI coding tool like Cursor or GitHub Copilot? […...",
    "content": "This week, I take a look at the surprisingly strong state of Google, Meta gets a new chief AI researcher, and more. If you haven't already, be sure to check out this week's Decoder episode about deepfakes and where they are headed.\nAlso, do you use an AI coding tool like Cursor or GitHub Copilot? I'd love to know what works and what doesn't…\n\n\"I think we are doing very well through this moment\"\nAfter spending time with Google executives during the company's I/O conference in May, it was clear that they were feeling confident. Now, I'm beginning to see why.\nChatGPT is not making Google Search obsolete. If anything, AI is making Google st …\nRead the full story at The Verge.",
    "source": "The Verge",
    "url": "https://www.theverge.com/command-line-newsletter/713603/google-search-chatgpt-openai-earnings-ai-race-swag",
    "published_at": "2025-07-25T19:52:59",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529499.4707048
  },
  {
    "id": "1c9b8be69dc5efb1b15ea51a3a29103a",
    "title": "Comcast&#8217;s fix for streaming service overload is in your cable box",
    "summary": "Streaming has become a tangled web of subscriptions, and now Comcast says it can help by putting all your services into one hub. Comcast is launching a new hub on its set-top boxes, called the StreamStore, where you can buy and manage subscriptions for more than 450 streaming apps and channels. The ...",
    "content": "Streaming has become a tangled web of subscriptions, and now Comcast says it can help by putting all your services into one hub. Comcast is launching a new hub on its set-top boxes, called the StreamStore, where you can buy and manage subscriptions for more than 450 streaming apps and channels.\nThe StreamStore lives within Xfinity’s Xumo Stream Box and on X1 devices. It’s also available on the web, and features a collection of more than 200,000 movies and TV shows to rent or purchase. Xfinity will let you add or drop channels through the store, while tacking on new subscriptions to your monthly internet or TV bill, further positioning the company as a sort of streaming broker. \nOther cable / telecom companies like Verizon have tried to step in as a digital subscription service middleman, though Comcast is taking things a step further by putting this hub on your TV. But is streaming really messy enough that you need Comcast to manage it?\nSome services included in the StreamStore include Netflix, Peacock, Disney Plus, Paramount Plus, Hulu, Apple TV Plus, HBO Max, and over 100 “niche” streaming subscriptions, according to LightReading. Xfinity already offers its own StreamSaver bundle, which includes a subscription to Apple TV Plus, Netflix with ads, and Peacock’s ad-supported plan for $15 per month.\nThe bundle is, of course, available through the StreamStore, and Xfinity says it plans on bringing new streaming bundles, apps, and “enhanced subscription management and activation capabilities” to the hub in the future.\n(Disclosure: Comcast is an investor in Vox Media, The Verge’s parent company.)",
    "source": "The Verge",
    "url": "https://www.theverge.com/news/714113/comcast-streamstore-xfinity-streaming-overload",
    "published_at": "2025-07-25T19:16:26",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529499.4712052
  },
  {
    "id": "829f5ee8e72658dc5d2ca02517a4bc0c",
    "title": "Breaking Bad creator’s new sci-fi show hits Apple in November",
    "summary": "As promised, Apple has finally revealed Pluribus, a new show from Breaking Bad creator Vince Gilligan that’s coming to Apple TV Plus. In addition to a very brief teaser involving some gross donut behavior, the streamer also confirmed that the show will premiere on November 7th. The show has been in ...",
    "content": "As promised, Apple has finally revealed Pluribus, a new show from Breaking Bad creator Vince Gilligan that’s coming to Apple TV Plus. In addition to a very brief teaser involving some gross donut behavior, the streamer also confirmed that the show will premiere on November 7th.\nThe show has been in the works for a while, as Apple first announced that it had picked up a Gilligan project back in 2022. It stars Rhea Seehorn, who previously worked with Gilligan on Better Call Saul. But there aren’t a lot of details other than that. According to Apple, the show — which is already confirmed for a second season –is about “the most miserable person on Earth” who “must save the world from happiness.” The rest of the cast includes Karolina Wydra, Carlos Manuel Vesga, Miriam Shor, and Samba Schutte.\nWhile details are slim, we do at least have one single image of Seehorn in the show:\n\nPluribus also adds to an ever-growing lineup of science fiction series on Apple TV Plus, including recent shows like Murderbot and new seasons of Foundation and Invasion, along with upcoming projects like an adaptation of Neuromancer.",
    "source": "The Verge",
    "url": "https://www.theverge.com/news/714080/pluribus-trailer-date-apple-tv-plus",
    "published_at": "2025-07-25T19:09:17",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529499.471916
  },
  {
    "id": "f32158002ed36aad7b44322e942b3134",
    "title": "Facebook ranks worst for online harassment, according to a global activist survey",
    "summary": "Activists around the world are calling attention to harassment they’ve faced on Meta’s platforms. More than 90 percent of land and environmental defenders surveyed by Global Witness, a nonprofit organization that also tracks the murders of environmental advocates, reported experiencing some kind of ...",
    "content": "Activists around the world are calling attention to harassment they’ve faced on Meta’s platforms. More than 90 percent of land and environmental defenders surveyed by Global Witness, a nonprofit organization that also tracks the murders of environmental advocates, reported experiencing some kind of online abuse or harassment connected to their work. Facebook was the most-cited platform, followed by X, WhatsApp, and Instagram.\nGlobal Witness and many of the activists it surveyed are calling on Meta and its peers to do more to address harassment and misinformation on their platforms. Left to fester, they fear that online attacks could fuel real-world risks to activists. Around 75 percent of people surveyed said they believed that online abuse they experienced corresponded to offline harm.\n“Those stats really stayed with me. They were so much higher than we expected them to be,” Ava Lee, campaign strategy lead on digital threats at Global Witness, tells The Verge. That’s despite expecting a gloomy outcome based on prior anecdotal accounts. “It has kind of long been known that the experience of climate activists and environmental defenders online is pretty awful,” Lee says.\nLeft to fester, they fear that online attacks could fuel real-world risks\nGlobal Witness surveyed more than 200 people between November 2024 and March of this year that it was able to reach through the same networks it taps when documenting the killings of land and environmental defenders. It found Meta-owned platforms to be “the most toxic.” Around 62 percent of participants said they encountered abuse on Facebook, 36 percent on WhatsApp, and 26 percent on Instagram. \nThat probably reflects how popular Meta’s platforms are around the world. Facebook has more than 3 billion active monthly users, more than a third of the global population. But Meta also abandoned its third-party fact-checking program in January, which critics warned could lead to more hate speech and disinformation. Meta moved to a crowdsourced approach to content moderation similar to X, where 37 percent of survey participants reported experiencing abuse. \nIn May, Meta reported a “small increase in the prevalence of bullying and harassment content” on Facebook as well as “a small increase in the prevalence of violent and graphic content” during the first quarter of 2025.\n“That’s sort of the irony as well, of them moving towards this kind of free speech model, which actually we’re seeing that it’s silencing certain voices,” says Hannah Sharpe, a senior campaigner at Global Witness.\nFatrisia Ain leads a local collective of women in Sulawesi, Indonesia, where she says palm oil companies have seized farmers’ lands and contaminated a river local villagers used to be able to rely on for drinking water. Posts on Facebook have accused her of being a communist, a dangerous allegation in her country, she tells The Verge.\nThe practice of “red-tagging” — labeling any dissident voices as communists — has been used to target and criminalize activists in Southeast Asia. In one high-profile case, a prominent environmental activist in Indonesia was jailed under “anti-communism” laws after opposing a new gold mine.\nAin says she’s asked Facebook to take down several posts attacking her, without success. “They said it’s not dangerous, so they can’t take it down. It is dangerous. I hope that Meta would understand, in Indonesia, it’s dangerous,” Ain says. \nOther posts have accused Ain of trying to defraud farmers and of having an affair with a married man, which she sees as attempts to discredit her that could wind up exposing her to more threats in the real world — which has already been hostile to her activism. “Women who are being the defenders for my own community are more vulnerable than men … more people harass you with so many things,” she says. \nNearly two-thirds of people who responded to the Global Witness survey said that they have feared for their safety, including Ain. She’s been physically targeted at protests against palm oil companies accused of failing to pay farmers, she tells The Verge. During a protest outside of a government office, men grabbed her butt and chest, she says. Now, when she leads protests, older women activists surround her to protect her as a security measure. \nIn the Global Witness survey, nearly a quarter of respondents said they’d been attacked on the basis of their sex. “There’s evidence of the way that women and women of color in particular in politics experience just vast amounts more hate than any other group,” Lee says. “Again, we’re seeing that play out when it comes to defenders … and the threats of sexual violence, and the impact that that is having on the mental health of lots of these defenders and their ability to feel safe.” \n“We encourage people to use tools available on our platforms to help protect against bullying and harassment,” Meta spokesperson Tracy Clayton said in an email to The Verge, adding that the company is reviewing Facebook posts that targeted Ain. Meta also pointed to its “Hidden Words” feature that allows you to filter offensive direct messages and comments on your posts and its “Limits” feature that hides comments on your posts from users that don’t follow you. \nOther companies mentioned in the report, including Google, TikTok, and X, did not provide on-the-record responses to inquiries from The Verge. Nor did a palm oil company Ain says has been operating on local farmers’ land without paying them, as they’re supposed to do under a mandated profit-sharing scheme. \nGlobal Witness says there are concrete steps social media companies can take to address harassment on their platforms. That includes dedicating more resources to their content moderation systems, regularly reviewing these systems, and inviting public input on the process. Activists surveyed also reported that they think algorithms that boost polarizing content and the proliferation of bots on platforms make the problem worse. \n“There are a number of choices that platforms could make,” Lee says. “Resourcing is a choice, and they could be putting more money into really good content moderation and really good trust and safety [initiatives] to improve things.” \nGlobal Witness plans to put out its next report on the killings of land and environmental defenders in September. Its last such report found that at least 196 people were killed in 2023.",
    "source": "The Verge",
    "url": "https://www.theverge.com/news/713976/online-harassment-meta-social-media-environmental-activists",
    "published_at": "2025-07-25T18:40:23",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529499.4731262
  },
  {
    "id": "4b81439630a7c07c937477721f9ba724",
    "title": "Anker is no longer selling 3D printers",
    "summary": "In March, charging giant Anker announced it would spin out its 3D printer business into an \"independent sub-brand,\" stating that the new EufyMake would \"continue to provide comprehensive customer service and support\" for its original 3D printers the AnkerMake M5 and M5C. Now, the 3D printing communi...",
    "content": "In March, charging giant Anker announced it would spin out its 3D printer business into an \"independent sub-brand,\" stating that the new EufyMake would \"continue to provide comprehensive customer service and support\" for its original 3D printers the AnkerMake M5 and M5C.  \nNow, the 3D printing community is wondering whether that was all a euphemism for exiting the 3D printer business. eufyMake is no longer selling any 3D printers and has stopped selling some of the parts it would need to provide anything close to \"comprehensive support.\"\nAnker confirms to The Verge that it has stopped selling the M5 and M5C 3D printers indefinitely. Spokes …\nRead the full story at The Verge.",
    "source": "The Verge",
    "url": "https://www.theverge.com/report/714006/anker-stop-selling-3d-printer-m5-m5c-parts-eufymake",
    "published_at": "2025-07-25T18:34:17",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529499.4734914
  },
  {
    "id": "697b88e20a31a2b4530cb9f22092f4b3",
    "title": "The best iPhones",
    "summary": "The wait is over — kind of. Apple’s iPhone 16 series is now widely available, including the kinda affordable 16E, and its much-hyped Apple Intelligence has arrived courtesy of iOS 18.1. But if you’re expecting a new kind of iPhone experience, well, I have some bad news for you. The AI features intro...",
    "content": "New iPhones for the AI era. | Image: Cath Virginia / The Verge\t\n\nThe wait is over — kind of. Apple’s iPhone 16 series is now widely available, including the kinda affordable 16E, and its much-hyped Apple Intelligence has arrived courtesy of iOS 18.1. But if you’re expecting a new kind of iPhone experience, well, I have some bad news for you. The AI features introduced in iOS 18.1 and more recent updates, including the writing tools and ChatGPT integration, are standard fare at this point. And although Siri has a new coat of paint, it’s basically the same old Siri.\nApple has promised much more, but the Apple Intelligence rollout is going to be a slow burn that lasts well into the fall. This is all to say that if you don’t have any complaints about how your current phone is working, you definitely shouldn’t rush out and get a new one just for Apple Intelligence.\nThat’s actually the gist of our phone buying philosophy: hang on to the one you’ve got. If you’re not the type of person to get excited about a new camera button, updated photo processing options, or incremental performance upgrades, then there’s no reason to run out and buy an iPhone 16.\nBut if you’re questioning whether it’s the year to replace your iPhone 11 or 12 (or you’re concerned about a price increase as a result of the current tariff situation), then I think the answer is an easy yes. There are real gains this time around, especially in the basic iPhone 16 and 16 Plus, without even considering AI. And if Apple Intelligence turns out to be something special eventually, well, you’ll be ready for it.\n\n\nThe best iPhone for most peopleThe best high-end iPhoneThe iPhone with the best battery lifeThe best inexpensive-ish iPhoneWhat about the iPhone 15?\n\n\nThe best iPhone for most people\niPhone 16\nApple’s baseline iPhone has a 6.1-inch screen, two rear cameras in a rearranged vertical layout, a customizable Action Button, and a new Camera Control button. It also supports Apple Intelligence, which has started rolling out throughout 2024, with further development continuing into 2025.\n\nScore: 8ProsConsReliable camera with versatile photographic stylesHandy new Action ButtonMore RAM and a current-gen chipsetStandard refresh rate screenCamera Control is a mixed bag\nWhere to Buy: $799 at Apple $829.99 at Best Buy $829.99 at Verizon\nScreen: 6.1-inch, 2556 x 1179 OLED, 60Hz refresh rate / Processor: A18 Cameras: 48-megapixel f/1.6 main with sensor-shift IS; 12-megapixel ultrawide; 12-megapixel selfie / Battery: Not advertised / Charging: 27W wired, 25W wireless MagSafe, 15W Qi2, 7.5W Qi / Weather-resistance rating: IP68\nApple’s basic iPhone enjoyed a significant hardware boost this time around, playing an overdue game of catch-up to the Pro series. The iPhone 16 includes the Action Button from 2023 Pro models — handy if there’s an app in your life you want to access at the touch of a button — and the new Camera Control. So if buttons are anything to go by, this phone is two better than the last-gen model.\nThere’s more going on under the hood, too. The A18 chipset is in the same generation as the processor on the Pro models, which hasn’t been the case for the past couple of years. That bodes well for the 16 series staying on the same update schedule. And there’s extra RAM in this year’s base model, which can only be a good thing.\n\nThe iPhone 16 became a much more interesting camera this time around, too. The Camera Control offers a quick way to launch the camera app and adjust settings like exposure compensation. But there’s also a new set of Photographic Style filters this time around, with options to adjust contrast, brightness, and undertones to dial in your preferred rendering of skin tones. You’ll get better low-light performance by stepping up to the 16 Pro models, and other cool tricks like 4K recording at 120 fps. But even without all that, it’s the most customizable camera Apple has offered yet.\nOutside of camera performance, there are two major drawbacks to picking the regular 16 over a Pro model: no zoom lens, and no ProMotion screen. Only the Pro has a dedicated 5x lens, which is handy for creative framing. And the standard 60Hz screen on the iPhone 16 will likely only bother you if you’re used to a smoother 120Hz display, though it’s annoying on principle that Apple keeps this feature to its Pro phones when virtually every other high-end phone has one.\nRead my full Apple iPhone 16 review.\nThe best high-end iPhone\niPhone 16 Pro\nThe iPhone 16 Pro sports a new 6.3-inch OLED panel with 120Hz refresh, all of which is powered by a new A18 Pro chip. Its triple camera array features a higher-res 48MP sensor for its ultrawide lens, and there’s a new physical Camera Control button for taking pictures and operating the camera app.\n\nScore: 8ProsConsNew tone control in camera lets you dial back HDR processingWho doesn’t love a physical shutter button?Your video director friends will spend hours gleefully taking 4K120 video portraits of people at street festivalsCamera Control button is a little fiddlyDefault photo processing is more aggressive than everThe most incremental of incremental upgrades over the iPhone 15 Pro\nWhere to Buy: $999 at Apple $999.99 at Best Buy $999.99 at Verizon\nScreen: 6.3-inch, 2622 x 1206 OLED, 120Hz refresh rate / Processor: A18 Pro Cameras: 48-megapixel f/1.8 with sensor-shift IS; 12-megapixel 5x telephoto with OIS; 48-megapixel ultrawide; 12-megapixel selfie / Battery: Not advertised / Charging: 27W wired, 25W MagSafe wireless, 15W Qi2, 7.5W Qi / Weather-resistance rating: IP68\nThe iPhone 16 Pro gets a small but meaningful upgrade this time around: a bump up to a 5x zoom, which on the 15 series was reserved for the Pro Max. And while the change from a 3x to 5x zoom doesn’t look that impressive on paper, it goes a long way to making the smaller 16 Pro feel like an equal to the 16 Pro Max. For once, you don’t need to get the biggest phone to get the best phone. \nThe 16 Pro is roughly the same size as the 15 Pro, but it has a bigger screen: 6.3 inches, up from 6.1 inches. There’s also the new Camera Control, an upgraded 48-megapixel ultrawide on board, and naturally, a new chipset that — naturally — supports Apple Intelligence.\n\nThere’s nothing here that makes the 16 Pro an absolute must-upgrade. Still, plenty of people will want the latest device with all the bells and whistles, and the 16 Pro represents an opportunity to get all of those features without having to buy the biggest phone.\nRead our full Apple iPhone 16 Pro review.\nThe iPhone with the best battery life\niPhone 16 Plus\nThe iPhone 16 Plus is the larger version of the iPhone 16, with a jumbo-sized 6.7-inch screen and a bigger battery. Like the smaller model, it starts with 128GB of storage and is configurable with up to 512GB.\n\nScore: 8ProsConsReliable camera with versatile photographic stylesHandy new action buttonMore RAM and a current-gen chipsetBig screen for big screen fansStandard refresh rate screenCamera control is a mixed bag\nWhere to Buy: $899 at Apple $929.99 at Best Buy $929.99 at Verizon\nScreen: 6.7-inch Super Retina OLED / Processor: A18 Cameras: 48-megapixel f/1.6 main with sensor-shift IS; 12-megapixel ultrawide; 12-megapixel selfie / Battery: Not advertised / Charging: 27W wired, 25W wireless MagSafe, 15W Qi2, 7.5W Qi / Weather-resistance rating: IP68\nThe thing about a big phone is that it has a big battery. And while that’s easy enough to understand, it still feels surprising how much more performance you can eke out of the iPhone 16 Plus’ battery. It’ll stretch well into a second day of use, and even if you’re conditioned to charge your phone every night, you’ll be amazed at how much you have left in the tank at the end of each day. It’s a solid antidote to battery anxiety.\n\nNaturally, the 16 Plus’ big-ness comes with another bonus: a bigger screen. The benefits are obvious here, too. But something that stands out to me when I use the phone is just how light it feels for its size, especially if you’re comparing it to the 16 Pro Max. If you like a big display but don’t need all of the weight of the Max — metaphorically and physically speaking — then the Plus is the way to go.\nRead our full Apple iPhone 16 Plus review.\nThe best inexpensive-ish iPhone\niPhone 16E\nThe iPhone 16E is the spiritual successor to the iPhone SE, bringing flagship-level performance for less than the standard 16. We really wish it included MagSafe for $599, but those upgrading from older iPhones will probably be satisfied with what’s included.\n\nScore: 7ProsConsReliable performanceGood, if limited, camera systemIt’s the cheapest new iPhone you can buyNo MagSafe$599 feels like $100 too muchNo ultrawide\nWhere to Buy: $599 at Apple $599.99 at Best Buy $599.99 at Verizon\nScreen: 6.1-inch Super Retina XDR / Processor: A18 Cameras: 48MP Fusion with 1x and 2x optical zoom, 12-megapixel selfie / Battery: Not advertised / Charging: 20-watt wired, 7.5W Qi, no MagSafe/ Weather-resistance rating: IP68\nThis recommendation comes with a heavy sigh. Yes, the 16E is the cheapest new iPhone Apple sells. Yes, it’s a good phone. It has a capable camera, reliable performance, full water resistance, wireless charging, and will be supported with software updates for years to come. But its $599 price tag starts to feel like too much when you consider what it’s missing. \nThere’s no MagSafe, which you can kind of add by way of a MagSafe case, but it’s a bummer not to have it built in when it has basically become a standard iPhone feature. There’s no ultrawide camera, no Dynamic Island housing timely information, no camera control (not a huge loss, honestly), and no Ultra Wideband for precise object tracking. It does support Apple Intelligence, but that doesn’t feel like much of a consolation, given that it’s very much still a work in progress.\nThe 16E will most likely receive more years of software support than a previous-gen model like the iPhone 14 or 15. And sure, Apple Intelligence might turn into something useful someday. The 16E is a good choice if you want the path of least resistance to blue bubbles and FaceTime at your fingertips. But if you’d like MagSafe, a more advanced camera, and some of the other bells and whistles that got lost on the way to the 16E, then it’s not a bad idea to look at one of the older iPhones.\nRead my full Apple iPhone 16E review.\n\nWhat about the iPhone 15?\nApple still sells the iPhone 15 new, cutting the price down to $699 with the introduction of the 16 series. There’s a strong argument for buying a 15 rather than the 16E if you don’t care about Apple Intelligence; the 15 Pro runs Apple Intelligence while the regular 15 doesn’t. Compared to the 16E, the iPhone 15 includes MagSafe, the Dynamic Island, an ultra wideband chip for precise item tracking, and an ultrawide camera. \nUpdate, July 25th: Updated to reflect current pricing / availability, with new links for relevancy.",
    "source": "The Verge",
    "url": "https://www.theverge.com/23618862/best-iphone-camera-battery-screen-guide",
    "published_at": "2025-07-25T18:20:34",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529499.4936202
  },
  {
    "id": "0aa9c236f34f684d317866008e6ed217",
    "title": "You can now easily buy a Switch 2 without jumping through hoops",
    "summary": "Perhaps we've been thinking the same thing, you and I. That there won't be a long-standing drought of Nintendo Switch 2 availability after all. The console has been easy to buy online from several retailers this week, including Best Buy, Target, and Walmart. Amazon, which didn't sell the Switch 2 at...",
    "content": "The Nintendo Switch 2 is easier to find than ever.\t\n\nPerhaps we've been thinking the same thing, you and I. That there won't be a long-standing drought of Nintendo Switch 2 availability after all. The console has been easy to buy online from several retailers this week, including Best Buy, Target, and Walmart. Amazon, which didn't sell the Switch 2 at launch, is currently selling it by invitation only.\nThe console's messy preorder process and spotty launch availability made it feel a little like late 2020 all over again, when the PlayStation 5, Xbox Series X, and Nvidia RTX 30-series GPUs launched in extremely limited quantities due to component shortages. However, Nintendo appears to have ad …\nRead the full story at The Verge.",
    "source": "The Verge",
    "url": "https://www.theverge.com/tech/713828/nintendo-switch-in-stock-best-buy-amazon-target-walmart",
    "published_at": "2025-07-25T18:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529499.494677
  },
  {
    "id": "cb104905ae283ce774984f1cabf83c48",
    "title": "Superman&#8217;s Fortress of Solitude is a Silver Age man cave inspired by nature&#8217;s beauty",
    "summary": "James Gunn knows that most people are familiar with Superman's origin story, which is why DC Studios' new feature about the Man of Steel opens at a point when he has already become a world famous superhero. Instead of rehashing the tragic beats of Krypton's destruction, the movie is punctuated with ...",
    "content": "James Gunn knows that most people are familiar with Superman's origin story, which is why DC Studios' new feature about the Man of Steel opens at a point when he has already become a world famous superhero. Instead of rehashing the tragic beats of Krypton's destruction, the movie is punctuated with moments that show you how deeply Superman cherishes the few remaining pieces of his homeworld. He loves his Kryptonian family crest and his out-of-control superdog. But the most impressive and alien keepsake that Clark Kent holds close to his heart is a massive stronghold buried deep beneath the ice in Antarctica.\nThe Fortress of Solitude (which  …\nRead the full story at The Verge.",
    "source": "The Verge",
    "url": "https://www.theverge.com/film/713692/superman-interview-beth-mickle",
    "published_at": "2025-07-25T17:45:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529499.4953263
  },
  {
    "id": "d4f6936727bf1e21a4503cd96ef1b52c",
    "title": "Meta announces its Superintelligence Labs Chief Scientist: former OpenAI GPT-4 co-creator Shengjia Zhao",
    "summary": "The move underscores Meta’s strategy of spending aggressively now to secure a dominant position in what it views as the next foundational technology platform.",
    "content": "The move underscores Meta’s strategy of spending aggressively now to secure a dominant position in what it views as the next foundational technology platform.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/meta-announces-its-superintelligence-labs-chief-scientist-former-openai-gpt-4-co-creator-shengjia-zhao/",
    "published_at": "2025-07-26T00:58:24",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529500.3956327
  },
  {
    "id": "43e9b6df99d98d4725a11345b8f6035e",
    "title": "New AI architecture delivers 100x faster reasoning than LLMs with just 1,000 training examples",
    "summary": "Hierarchical Reasoning Models (HRM) tackle complex reasoning tasks while being smaller, faster, and more data-efficient than large AI models.",
    "content": "Hierarchical Reasoning Models (HRM) tackle complex reasoning tasks while being smaller, faster, and more data-efficient than large AI models.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/new-ai-architecture-delivers-100x-faster-reasoning-than-llms-with-just-1000-training-examples/",
    "published_at": "2025-07-25T23:27:42",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529500.3957803
  },
  {
    "id": "cfdd7b14c659742067498a6ff3801f61",
    "title": "CoSyn: The open-source tool that’s making GPT-4V-level vision AI accessible to everyone",
    "summary": "Researchers at the University of Pennsylvania and the Allen Institute for Artificial Intelligence have developed a groundbreaking tool that allows open-source AI systems to match or surpass the visual understanding capabilities of proprietary models like GPT-4V and Gemini 1.5 Flash, potentially resh...",
    "content": "Researchers at the University of Pennsylvania and the Allen Institute for Artificial Intelligence have developed a groundbreaking tool that allows open-source AI systems to match or surpass the visual understanding capabilities of proprietary models like GPT-4V and Gemini 1.5 Flash, potentially reshaping the competitive landscape between open and c…Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/business/cosyn-the-open-source-tool-thats-making-gpt-4v-level-vision-ai-accessible-to-everyone/",
    "published_at": "2025-07-25T20:05:12",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529500.395949
  },
  {
    "id": "5137a9772186ff19f0bfe0de70579850",
    "title": "It’s Qwen’s summer: new open source Qwen3-235B-A22B-Thinking-2507 tops OpenAI, Gemini reasoning models on key benchmarks",
    "summary": "The new Qwen3-Thinking-2507, as we'll call it for short, now leads or closely trails top-performing models across several major benchmarks.",
    "content": "The new Qwen3-Thinking-2507, as we'll call it for short, now leads or closely trails top-performing models across several major benchmarks.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/its-qwens-summer-new-open-source-qwen3-235b-a22b-thinking-2507-tops-openai-gemini-reasoning-models-on-key-benchmarks/",
    "published_at": "2025-07-25T15:47:28",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529500.3960736
  },
  {
    "id": "53a25967a64accf62726978d8bac4da9",
    "title": "Anthropic unveils ‘auditing agents’ to test for AI misalignment",
    "summary": "Anthropic developed its auditing agents while testing Claude Opus 4 for alignment issues.",
    "content": "Anthropic developed its auditing agents while testing Claude Opus 4 for alignment issues.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/anthropic-unveils-auditing-agents-to-test-for-ai-misalignment/",
    "published_at": "2025-07-24T22:15:53",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529500.3962111
  },
  {
    "id": "08c6ef76b82ff8a2691d1135420087a6",
    "title": "Freed says 20,000 clinicians are using its medical AI transcription ‘scribe,’ but competition is rising fast",
    "summary": "Rather than chase enterprise contracts with large hospital systems, Freed has focused on small clinics and solo practitioners.",
    "content": "Rather than chase enterprise contracts with large hospital systems, Freed has focused on small clinics and solo practitioners.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/freed-says-20000-clinicians-are-using-its-medical-ai-transcription-scribe-but-competition-is-rising-fast/",
    "published_at": "2025-07-24T21:46:29",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529500.3963351
  },
  {
    "id": "aa644807bc21b486e675cb5a11671785",
    "title": "White House plan signals “open-weight first” era—and enterprises need new guardrails",
    "summary": "Enterprises will not see immediate impact from the AI Action Plan, but it signals wider support for open-source models and evaluations.",
    "content": "Enterprises will not see immediate impact from the AI Action Plan, but it signals wider support for open-source models and evaluations.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/white-house-plan-signals-open-weight-first-era-and-enterprises-need-new-guardrails/",
    "published_at": "2025-07-23T23:24:14",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529500.3964593
  },
  {
    "id": "0ab3ea42115ee7ee6d9cb9b153358fd0",
    "title": "SecurityPal combines AI and experts in Nepal to speed enterprise security questionnaires by 87X or more",
    "summary": "The Kathmandu center of excellence gives SecurityPal a cost base low enough to keep humans in the loop while staying price-competitive.",
    "content": "The Kathmandu center of excellence gives SecurityPal a cost base low enough to keep humans in the loop while staying price-competitive.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/security/securitypal-combines-ai-and-experts-in-nepal-to-speed-enterprise-security-questionnaires-by-87x-or-more/",
    "published_at": "2025-07-23T22:41:32",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529500.396578
  },
  {
    "id": "d1f729b967e4a226edc4a5fd1cbd2969",
    "title": "Qwen3-Coder-480B-A35B-Instruct launches and it ‘might be the best coding model yet’",
    "summary": "Developers can define custom tools and let Qwen3-Coder dynamically invoke them during conversation or code generation tasks.",
    "content": "Developers can define custom tools and let Qwen3-Coder dynamically invoke them during conversation or code generation tasks.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/programming-development/qwen3-coder-480b-a35b-instruct-launches-and-it-might-be-the-best-coding-model-yet/",
    "published_at": "2025-07-23T21:49:39",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529500.3967397
  },
  {
    "id": "260dda8a6375ca6d05e0d2da8e665e9a",
    "title": "Early Anthropic hire raises $15M to insure AI agents and help startups deploy safely",
    "summary": "AIUC will insure AI agents, helping enterprises deploy artificial intelligence securely with risk coverage and safety standards.",
    "content": "AIUC will insure AI agents, helping enterprises deploy artificial intelligence securely with risk coverage and safety standards.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/former-anthropic-exec-raises-15m-to-insure-ai-agents-and-help-startups-deploy-safely/",
    "published_at": "2025-07-23T15:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529500.396861
  },
  {
    "id": "793bef662f1894dff9181a5cf7f73073",
    "title": "Author Correction: Immune evasion through mitochondrial transfer in the tumour microenvironment",
    "summary": "Nature, Published online: 25 July 2025; doi:10.1038/s41586-025-09408-xAuthor Correction: Immune evasion through mitochondrial transfer in the tumour microenvironment",
    "content": "Nature, Published online: 25 July 2025; doi:10.1038/s41586-025-09408-xAuthor Correction: Immune evasion through mitochondrial transfer in the tumour microenvironment",
    "source": "Nature",
    "url": "https://www.nature.com/articles/s41586-025-09408-x",
    "published_at": "2025-07-25T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529502.9445412
  },
  {
    "id": "9cea002827ca6834018fec1841c9eb39",
    "title": "Author Correction: Human HDAC6 senses valine abundancy to regulate DNA damage",
    "summary": "Nature, Published online: 25 July 2025; doi:10.1038/s41586-025-09409-wAuthor Correction: Human HDAC6 senses valine abundancy to regulate DNA damage",
    "content": "Nature, Published online: 25 July 2025; doi:10.1038/s41586-025-09409-wAuthor Correction: Human HDAC6 senses valine abundancy to regulate DNA damage",
    "source": "Nature",
    "url": "https://www.nature.com/articles/s41586-025-09409-w",
    "published_at": "2025-07-25T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529502.9447348
  },
  {
    "id": "c88e81a7546b58b11cac200280a39014",
    "title": "Ageing accelerates around age 50 ― some organs faster than others",
    "summary": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-02333-zAn analysis of how various tissues age is the latest to suggest that ageing does not march to a steady beat.",
    "content": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-02333-zAn analysis of how various tissues age is the latest to suggest that ageing does not march to a steady beat.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02333-z",
    "published_at": "2025-07-25T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529502.9449098
  },
  {
    "id": "4c1dba48168dc6a6f8a8b8f8aa090ed0",
    "title": "Mystery food in Neanderthal diet might be maggots",
    "summary": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-02334-yStudy of rotting human cadavers hints that a puzzling chemical marker in Neanderthal remains could be from eating the larvae.",
    "content": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-02334-yStudy of rotting human cadavers hints that a puzzling chemical marker in Neanderthal remains could be from eating the larvae.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02334-y",
    "published_at": "2025-07-25T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529502.9450986
  },
  {
    "id": "f02b96c486b4f94fe2d06eb5d6d59bbe",
    "title": "How to tackle research misconduct: survey finds stark disagreement",
    "summary": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-02365-5Data sleuths and research-integrity officers have different views on how to handle allegations of wrongdoing in science.",
    "content": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-02365-5Data sleuths and research-integrity officers have different views on how to handle allegations of wrongdoing in science.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02365-5",
    "published_at": "2025-07-25T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529502.9452825
  },
  {
    "id": "457ecdb1339cbd4d439baf2254a7eb4a",
    "title": "Meet the early career scientists planning to leave the United States",
    "summary": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-01900-8Decreased funding, reduced opportunities and growing uncertainty has made life tough for international postdocs living in the US.",
    "content": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-01900-8Decreased funding, reduced opportunities and growing uncertainty has made life tough for international postdocs living in the US.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-01900-8",
    "published_at": "2025-07-25T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529502.9454854
  },
  {
    "id": "86643e358a8037ed07e480c5d46807f1",
    "title": "This fish-inspired suction cup can stick to your organs",
    "summary": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02361-9The device could be swallowed for drug delivery or medical monitoring.",
    "content": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02361-9The device could be swallowed for drug delivery or medical monitoring.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02361-9",
    "published_at": "2025-07-24T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529502.945634
  },
  {
    "id": "fb3a8a35b2d95c20be7c6df98177ce41",
    "title": "Unexpected danger lurks in this giant fault in the Yukon",
    "summary": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02310-6The Tintina fault has triggered many more earthquakes than was thought — and a build-up of strain poses a hazard.",
    "content": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02310-6The Tintina fault has triggered many more earthquakes than was thought — and a build-up of strain poses a hazard.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02310-6",
    "published_at": "2025-07-24T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529502.9457905
  },
  {
    "id": "7a21fcd44b3b0dc66d99ec10a6de2297",
    "title": "Daily briefing: Damaging the climate could violate international law, court rules",
    "summary": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02369-1A landmark court ruling could open the door for nations most affected by climate change to sue the most polluting countries. Plus, an artificial intelligence model that can predict lost Latin text and a fish-inspired medical devic...",
    "content": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02369-1A landmark court ruling could open the door for nations most affected by climate change to sue the most polluting countries. Plus, an artificial intelligence model that can predict lost Latin text and a fish-inspired medical device that sticks to slippery surfaces.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02369-1",
    "published_at": "2025-07-24T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529502.9460921
  },
  {
    "id": "9386e1ae44e497ee834ee92ce563ba9e",
    "title": "DeepMind and OpenAI models solve maths problems at level of top students",
    "summary": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02343-xFor the first time, large language models performed on a par with gold medallists in the International Mathematical Olympiad.",
    "content": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02343-xFor the first time, large language models performed on a par with gold medallists in the International Mathematical Olympiad.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02343-x",
    "published_at": "2025-07-24T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529502.9463117
  },
  {
    "id": "80c20b274f5a438e0ccebc0ce4606a87",
    "title": "USDA reorganization will cut agricultural and forest research",
    "summary": "One of the agency’s largest and most storied research facilities will be closed along with most forest research stations",
    "content": "One of the agency’s largest and most storied research facilities will be closed along with most forest research stations",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/usda-reorganization-will-cut-agricultural-and-forest-research",
    "published_at": "2025-07-25T05:30:04",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529504.4508092
  },
  {
    "id": "02a4b3f7070809fea655e971c1335108",
    "title": "‘Things keep evolving into anteaters.’ Odd animals arose at least 12 separate times",
    "summary": "Findings speak to the dramatic impact ants and termites can have on mammalian evolution",
    "content": "Findings speak to the dramatic impact ants and termites can have on mammalian evolution",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/things-keep-evolving-anteaters-odd-animals-arose-least-12-separate-times",
    "published_at": "2025-07-25T02:05:12",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529504.4508872
  },
  {
    "id": "1589f5a0cbf4ee9c8f3e39704fd5ace7",
    "title": "Congressional panels resist White House proposals for sharp cuts in indirect cost rates",
    "summary": "Three spending panels say a 15% cap isn’t the right answer to nagging concerns about how universities are reimbursed",
    "content": "Three spending panels say a 15% cap isn’t the right answer to nagging concerns about how universities are reimbursed",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/congressional-panels-resist-white-house-proposals-sharp-cuts-indirect-cost-rates",
    "published_at": "2025-07-25T11:45:01",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529504.4509528
  },
  {
    "id": "306522ab7198518daf388fd9d1303e62",
    "title": "Columbia’s $221 million deal with Trump officials draws mixed reactions from researchers",
    "summary": "Relief that NIH funding will be restored mingles with fears that academic independence will suffer—and that other universities will make similar concessions",
    "content": "Relief that NIH funding will be restored mingles with fears that academic independence will suffer—and that other universities will make similar concessions",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/columbia-s-221-million-deal-trump-officials-draws-mixed-reactions-researchers",
    "published_at": "2025-07-24T08:45:32",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529504.4510238
  },
  {
    "id": "c250db6dd80fba2a568b1c33f387dd3a",
    "title": "This trilobite fossil became ancient Roman bling",
    "summary": "It’s the first example of this common fossil found in the ancient Roman world",
    "content": "It’s the first example of this common fossil found in the ancient Roman world",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/trilobite-fossil-became-ancient-roman-bling",
    "published_at": "2025-07-24T05:10:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529504.4510837
  },
  {
    "id": "254383983376580b8a0121dd24aab0dd",
    "title": "Fifteen years later, <cite>Science</cite> retracts ‘arsenic life’ paper despite study authors’ protests",
    "summary": "Belated decision on widely disputed 2010 study pleases some critics but puzzles and dismays others",
    "content": "Belated decision on widely disputed 2010 study pleases some critics but puzzles and dismays others",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/fifteen-years-later-science-retracts-arsenic-life-paper-despite-study-authors",
    "published_at": "2025-07-24T02:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529504.451143
  },
  {
    "id": "69d470a731e0cc3fd1a0a67e39b8fffc",
    "title": "Three ancient human relatives once shared the same valley. Did they meet—and compete?",
    "summary": "The world’s greatest concentration of ancestral human remains, in South Africa, poses a 2-million-year-old riddle of coexistence",
    "content": "The world’s greatest concentration of ancestral human remains, in South Africa, poses a 2-million-year-old riddle of coexistence",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/three-ancient-human-relatives-once-shared-same-valley-did-they-meet-and-compete",
    "published_at": "2025-07-24T02:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529504.4512017
  },
  {
    "id": "a0335d85091d9531a43963e75a428b50",
    "title": "Trump’s plan to slash global health spending rejected by key spending panel",
    "summary": "House of Representatives committee signals support for HIV/AIDS and other funding",
    "content": "House of Representatives committee signals support for HIV/AIDS and other funding",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/trump-s-plan-slash-global-health-spending-rejected-key-spending-panel",
    "published_at": "2025-07-23T05:25:53",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529504.4512587
  },
  {
    "id": "807d54d0d5f45893813d9ca64eb351e6",
    "title": "Cheap drug could fight malaria by spoiling mosquitoes’ blood meal",
    "summary": "Field study in Kenya suggests innovative strategy has promise—but some researchers question its viability",
    "content": "Field study in Kenya suggests innovative strategy has promise—but some researchers question its viability",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/well-known-drug-could-make-human-blood-toxic-malaria-transmitting-mosquitoes",
    "published_at": "2025-07-23T05:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529504.451314
  },
  {
    "id": "bfc0a5640f8a22d51485459fb4542b9b",
    "title": "Songbirds play optical tricks to make their feather colors ‘pop’",
    "summary": "Concealed black or white bands on feathers boost the vibrancy of bird plumage",
    "content": "Concealed black or white bands on feathers boost the vibrancy of bird plumage",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/songbirds-play-optical-tricks-make-their-feather-colors-pop",
    "published_at": "2025-07-23T02:00:08",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753529504.451369
  },
  {
    "id": "386929c62ca2b133a28e061e3120dd59",
    "title": "Revolutionary AI Breakthrough in Local Processing",
    "summary": "Researchers achieve significant improvements in on-device AI processing, enabling faster and more private artificial intelligence applications.",
    "content": "A team of researchers has developed new techniques for optimizing AI models to run efficiently on local devices, reducing the need for cloud processing and improving user privacy. The breakthrough includes novel quantization methods and hardware acceleration techniques.",
    "source": "Mock_News",
    "url": "https://example.com/article/technology/0",
    "published_at": "2025-07-26T18:31:44.451420",
    "category": "technology",
    "language": "en",
    "importance": 0.9,
    "processed_at": 1753529504.4514246
  },
  {
    "id": "d257aa1be7a0506927d8f6af1e38c7e5",
    "title": "Voice AI Systems Reach Human-Level Understanding",
    "summary": "Latest voice recognition and response systems demonstrate unprecedented accuracy in natural language understanding and generation.",
    "content": "Modern voice assistant technology has achieved remarkable milestones in understanding context, emotion, and nuanced human communication, making interactions more natural and helpful than ever before.",
    "source": "Mock_News",
    "url": "https://example.com/article/technology/1",
    "published_at": "2025-07-26T17:31:44.451427",
    "category": "technology",
    "language": "en",
    "importance": 0.8,
    "processed_at": 1753529504.4514303
  },
  {
    "id": "ff4cd811eaf4e1b45199a1c4ba1ce2e0",
    "title": "Quantum Computing Achieves New Stability Record",
    "summary": "Scientists maintain quantum coherence for record-breaking duration, bringing practical quantum computers closer to reality.",
    "content": "A breakthrough in quantum error correction and coherence maintenance has been achieved, with quantum states remaining stable for over 100 seconds under controlled conditions.",
    "source": "Mock_News",
    "url": "https://example.com/article/science/0",
    "published_at": "2025-07-26T18:31:44.451433",
    "category": "science",
    "language": "en",
    "importance": 0.8,
    "processed_at": 1753529504.4514353
  },
  {
    "id": "96bfada28efd3dd1b0e8303a5a28eed7",
    "title": "Best Noise-Canceling Headphones: Sony, Bose, Apple, and More",
    "summary": "Tune out (or rock out) with our favorite over-ears and earbuds.",
    "content": "Tune out (or rock out) with our favorite over-ears and earbuds.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/gallery/best-noise-canceling-headphones/",
    "published_at": "2025-07-26T14:03:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.5258944
  },
  {
    "id": "6ff476d7f58031e8f59570c634f35423",
    "title": "CookUnity Prepared Meal Delivery Review (2025): Chef-Centric Meals",
    "summary": "In a world filled with mediocre ready-to-eat meals, CookUnity is the first I’ve tried that feels like real cooking. Not every meal hits, but enough do.",
    "content": "In a world filled with mediocre ready-to-eat meals, CookUnity is the first I’ve tried that feels like real cooking. Not every meal hits, but enough do.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/review/cookunity-prepared-meal-delivery/",
    "published_at": "2025-07-26T13:36:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.5259714
  },
  {
    "id": "b4bdf0b5b513b64c22152a9b23893e1d",
    "title": "Razer Pro Click V2 Vertical Review: A Hybrid Gaming Mouse",
    "summary": "The Pro Click V2 Vertical has a steep learning curve but effectively brings the ergonomic benefits of a vertical mouse to the gaming peripheral.",
    "content": "The Pro Click V2 Vertical has a steep learning curve but effectively brings the ergonomic benefits of a vertical mouse to the gaming peripheral.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/review/razer-pro-click-v2-vertical/",
    "published_at": "2025-07-26T13:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.5260322
  },
  {
    "id": "68eced35693a4e85d0e584af73d8c6a6",
    "title": "Nemo Dagger Osmo Tent Review (2025): 2-Person Backcountry Palace",
    "summary": "Nemo’s updated Dagger Osmo 2-person tent is a well-designed, spacious palace of a tent.",
    "content": "Nemo’s updated Dagger Osmo 2-person tent is a well-designed, spacious palace of a tent.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/review/nemo-dagger-osmo-tent-2025/",
    "published_at": "2025-07-26T12:32:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.5260892
  },
  {
    "id": "dbe314bd0e145a9961d5f5c277c113a8",
    "title": "Best Breast Pumps (2025): Wearable, Portable, Easy to Clean",
    "summary": "Got milk? From wearables to popular portables, these are the breast pumps we recommend for your nursing era.",
    "content": "Got milk? From wearables to popular portables, these are the breast pumps we recommend for your nursing era.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/gallery/breast-pump-buying-guide/",
    "published_at": "2025-07-26T12:02:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.5262303
  },
  {
    "id": "73f60a2906c2bebe409390b2dcf93b3f",
    "title": "The 21 Best Movies on Amazon Prime Right Now (August 2025)",
    "summary": "Deep Cover, Heads of State, and Challengers are just a few of the movies you should be watching on Amazon Prime Video this week.",
    "content": "Deep Cover, Heads of State, and Challengers are just a few of the movies you should be watching on Amazon Prime Video this week.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/best-amazon-prime-movies/",
    "published_at": "2025-07-26T11:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.5263174
  },
  {
    "id": "c299f7733fd6782cf3d7d978c10e2e2c",
    "title": "The Texas Floods Were a Preview of What’s to Come",
    "summary": "Mounting evidence shows no US state is safe from the flooding that ravaged Texas’ Kerr Country.",
    "content": "Mounting evidence shows no US state is safe from the flooding that ravaged Texas’ Kerr Country.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/kerr-countys-tragic-flood-wasnt-an-outlier-it-was-a-preview/",
    "published_at": "2025-07-26T11:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.5263774
  },
  {
    "id": "99b965bfa2211fa3d07a7ffeab365014",
    "title": "Do You Need a Barbecue Knife?",
    "summary": "These specialty blades—cutlass-shaped mini machetes made for chopping grilled and smoked meats—aren’t a necessary addition to your grill game. But they’re fun, and they get the job done.",
    "content": "These specialty blades—cutlass-shaped mini machetes made for chopping grilled and smoked meats—aren’t a necessary addition to your grill game. But they’re fun, and they get the job done.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/do-you-need-a-barbecue-knife/",
    "published_at": "2025-07-26T10:30:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.5264375
  },
  {
    "id": "9d6859ca705873e8067b7e02146c5545",
    "title": "60 Italian Mayors Want to Be the Unlikely Solution to Self-Driving Cars in Europe",
    "summary": "A network of local officials in Italy want to turn their cities into laboratories for the vehicles of tomorrow in the hope of catching up with the US and China.",
    "content": "A network of local officials in Italy want to turn their cities into laboratories for the vehicles of tomorrow in the hope of catching up with the US and China.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/60-italian-mayors-want-to-be-the-unlikely-solution-to-self-driving-cars-in-europe/",
    "published_at": "2025-07-26T10:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.5267022
  },
  {
    "id": "1d30009a7a1e94215547a00dd6b6dbe1",
    "title": "Gear News of the Week: Amazon Buys Bee, VSCO Has a New App, and CMF Debuts a Smartwatch",
    "summary": "Plus: Google Photos lets you convert images to videos, Microsoft has a 5G Surface, and Palmer Luckey asks if you’d buy a US-made laptop.",
    "content": "Plus: Google Photos lets you convert images to videos, Microsoft has a 5G Surface, and Palmer Luckey asks if you’d buy a US-made laptop.",
    "source": "Feed: All Latest",
    "url": "https://www.wired.com/story/gear-news-of-the-week-amazon-buys-bee-vsco-has-a-new-app-and-cmf-debuts-a-smartwatch/",
    "published_at": "2025-07-26T09:32:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.5268533
  },
  {
    "id": "8347488ca894a7debc1acf7639671c5b",
    "title": "Microsoft to stop using China-based teams to support Department of Defense",
    "summary": "The tech giant has relied on global workforce to support federal clients.",
    "content": "Last week, Microsoft announced that it would no longer use China-based engineering teams to support the Defense Department’s cloud computing systems, following ProPublica’s investigation of the practice, which cybersecurity experts said could expose the government to hacking and espionage.\nBut it turns out the Pentagon was not the only part of the government facing such a threat. For years, Microsoft has also used its global workforce, including China-based personnel, to maintain the cloud systems of other federal departments, including parts of Justice, Treasury and Commerce, ProPublica has found.\nThis work has taken place in what’s known as the Government Community Cloud, which is intended for information that is not classified but is nonetheless sensitive. The Federal Risk and Authorization Management Program, the US government’s cloud accreditation organization, has approved GCC to handle “moderate” impact information “where the loss of confidentiality, integrity, and availability would result in serious adverse effect on an agency’s operations, assets, or individuals.”Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/security/2025/07/microsoft-to-stop-using-china-based-teams-to-support-department-of-defense/",
    "published_at": "2025-07-26T11:00:21",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.7445297
  },
  {
    "id": "c6b171af3abe039b4aa042bb179ee9bc",
    "title": "This aerogel and some sun could make saltwater drinkable",
    "summary": "Previous aerogels didn't work on a scale that was large enough to matter.",
    "content": "Earth is about 71 percent water. An overwhelming 97 percent of that water is found in the oceans, leaving us with only 3 percent in the form of freshwater—and much of that is frozen in the form of glaciers. That leaves just 0.3 percent of that freshwater on the surface in lakes, swamps, springs, and our main sources of drinking water, rivers and streams.\nDespite our planet’s famously blue appearance from space, thirsty aliens would be disappointed. Drinkable water is actually pretty scarce.\nAs if that doesn’t already sound unsettling, what little water we have is also threatened by climate change, urbanization, pollution, and a global population that continues to expand. Over 2 billion people live in regions where their only source of drinking water is contaminated. Pathogenic microbes in the water can cause cholera, diarrhea, dysentery, polio, and typhoid, which could be fatal in areas without access to vaccines or medical treatment.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/science/2025/07/this-aerogel-and-some-sun-could-make-saltwater-drinkable/",
    "published_at": "2025-07-26T10:00:52",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.745114
  },
  {
    "id": "7d4a8b7740977ed3909b6e9b01979aef",
    "title": "After BlackSuit is taken down, new ransomware group Chaos emerges",
    "summary": "As BlackSuit's dark web site goes dark, Chaos is already around to pick up the slack.",
    "content": "Hot on the heels of a major ransomware group being taken down through an international law enforcement operation comes a new development that highlights the whack-a-mole nature of such actions: A new group, likely comprised of some of the same members, has already taken its place.\nThe new group calls itself Chaos, in recognition of the .chaos name extension its ransomware stamps on files it has encrypted and the “readme.chaos[.]txt” name given to ransom notes sent to victims. Researchers at Cisco’s Talos Security Group said Thursday that since Chaos emerged in February, it has engaged in “big-game hunting”—meaning attacks designed to extract hefty payments—that have mainly targeted organizations in the US and, to a lesser extent, the UK, New Zealand, and India. Talos said it recently observed the group demanding a ransom of about $300,000.\nWalking in your footsteps\nIn exchange for paying the demanded ransom, victims get a pinky swear that they’ll receive a decryptor and a detailed report of the vulnerabilities the group members found in the victim’s network and that the group will delete all the data in its possession. Victims who refuse to pay face the threat of never getting their data unlocked, having data publicly disclosed, and being subjected to distributed denial-of-service attacks.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/security/2025/07/after-blacksuit-is-taken-down-new-ransomware-group-chaos-emerges/",
    "published_at": "2025-07-26T00:21:30",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.7454197
  },
  {
    "id": "6201e1cad79b12e813ebd6e6acbcb7b2",
    "title": "Starlink kept me connected to the Internet without fail—until Thursday",
    "summary": "\"Starlink went down across the entire front.\"",
    "content": "A rare global interruption in the Starlink satellite Internet network knocked subscribers offline for more than two hours on Thursday, the longest widespread outage since SpaceX opened the service to consumers nearly five years ago.\nThe outage affected civilian and military users, creating an inconvenience for many but cutting off a critical lifeline for those who rely on Starlink for military operations, health care, and other applications.\nMichael Nicolls, SpaceX's vice president of Starlink engineering, wrote on X that the network outage lasted approximately 2.5 hours.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/space/2025/07/starlink-kept-me-connected-to-the-internet-without-fail-until-thursday/",
    "published_at": "2025-07-25T22:17:23",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.7456632
  },
  {
    "id": "20d25338f55f6341c8a0a6ac1a7b7360",
    "title": "North Korean hackers ran US-based “laptop farm” from Arizona woman’s home",
    "summary": "North Korea made millions from the scheme.",
    "content": "Christina Chapman, a 50-year-old Arizona woman, has just been sentenced to 102 months in prison for helping North Korean hackers steal US identities in order to get \"remote\" IT jobs with more than 300 American companies, including Nike. The scheme funneled millions of dollars to the North Korean state.\nWhy did Chapman do it? In a letter sent this week to the judge, Chapman said that she was \"looking for a job that was Monday through Friday that would allow me to be present for my mom\" who was battling cancer. (Her mother died in 2023.) But \"the area where we lived didn't provide for a lot of job opportunities that fit what I needed. I also thought that the job was allowing me to help others.\"\nShe offered her \"deepest and sincerest apologies to any person who was harmed by my actions,\" thanked the FBI for busting her, and said that when she gets out of prison, she hopes to \"pursue the books that I have been working on writing and starting my own underwear company.\"Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/security/2025/07/north-korean-hackers-ran-us-based-laptop-farm-from-arizona-womans-home/",
    "published_at": "2025-07-25T21:39:17",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.7458913
  },
  {
    "id": "dffecc999d81a25c7b66f26b49a5e2fa",
    "title": "Widely panned arsenic life paper gets retracted—15 years after brouhaha",
    "summary": "Opinions are mixed on the retraction, and the authors continue to defend their work.",
    "content": "In December 2010, a study led by a NASA astrobiology fellow claimed to have found an alien-like microbe in a salty, alkaline lake in California. This extraordinary bacterium could reportedly thrive using the toxic element arsenic in place of phosphorus—otherwise thought essential for life on Earth. It even incorporated arsenic, instead of phosphorus, into the backbone of its DNA, according to the study, which was published online by the prestigious journal Science.\nIf true, the claims were groundbreaking. And NASA's press team only hyped the potential significance. In press materials, the agency claimed the finding \"begs a rewrite of biology textbooks\" and \"will impact the search for evidence of extraterrestrial life.\" In a subsequent press conference, the lead author, Felisa Wolfe-Simon, didn't hold back, either, saying, \"We've cracked open the door to what's possible for life elsewhere in the universe and that's profound.\"\nBacklash\nBut upon that very splashy debut, outside scientists quickly identified flaws and problems in the study. When the study finally appeared in the June 3, 2011, print issue of Science, it was accompanied by eight \"technical comments\" blasting the study claims.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/science/2025/07/widely-panned-arsenic-life-paper-gets-retracted-15-years-after-brouhaha/",
    "published_at": "2025-07-25T20:26:44",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.746273
  },
  {
    "id": "33641b8977e1ddddbd3d81406027297e",
    "title": "Echelon kills smart home gym equipment offline capabilities with update",
    "summary": "Update also blocks compatibility with popular third-party apps.",
    "content": "A firmware update has killed key functionality for Echelon smart home gym equipment that isn't connected to the Internet.\nAs explained in a Tuesday blog post by Roberto Viola, who develops the \"QZ (qdomyos-zwift)\" app that connects Echelon machines to third-party fitness platforms, like Peloton, Strava, and Apple HealthKit, the firmware update forces Echelon machines to connect to Echelon’s servers in order to work properly. A user online reported that as a result of updating his machine, it is no longer syncing with apps like QZ, and he is unable to view his machine's exercise metrics in the Echelon app without an Internet connection.\nAffected Echelon machines reportedly only have full functionality, including the ability to share real-time metrics, if a user has the Echelon app active and if the machine is able to reach Echelon’s servers. Viola wrote:Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/gadgets/2025/07/firmware-update-hinders-echelon-smart-home-gym-equipments-ability-to-work-offline/",
    "published_at": "2025-07-25T20:10:31",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.746686
  },
  {
    "id": "1326df0f8020b6ecefb954bb413ecb8b",
    "title": "OpenAI’s most capable AI model, GPT-5, may be coming in August",
    "summary": "Sources say new model combines o3 reasoning with general GPT capabilities.",
    "content": "On Thursday, The Verge reported that OpenAI is preparing to launch GPT-5 as early as August, according to sources familiar with the company's plans. The report comes five months after CEO Sam Altman first laid out a roadmap for the next-generation AI model that would unify the company's various AI capabilities. OpenAI CEO Sam Altman revealed in a post on X last week that the company plans to release GPT-5 \"soon.\"\nAccording to The Verge's Tom Warren, Microsoft engineers began preparing server capacity for GPT-5 as early as late May, but testing and development challenges pushed the timeline back. During an appearance on Theo Von's podcast this week, Altman demonstrated the model's capabilities by having it answer a question he couldn't. \"I put it in the model, this is GPT-5, and it answered it perfectly,\" Altman said, saying it gave him a \"weird feeling\" to see the AI model answer a question that he couldn't.\nGPT-5 has been a highly anticipated release since the launch of GPT-4 in March 2023. In fact, we first wrote about rumors of GPT-5's launch in March 2024, but it appears that GPT-5 did not materialize last year because the company saved the \"GPT-5\" name for a future release.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/ai/2025/07/openais-most-capable-ai-model-gpt-5-may-be-coming-in-august/",
    "published_at": "2025-07-25T19:59:37",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.7469962
  },
  {
    "id": "5acfe6aedf3bc22f21604999c852b081",
    "title": "Remembering Descent, the once-popular, fully 3D 6DOF shooter",
    "summary": "Descent is a big part of gaming history, but not many people talk about it.",
    "content": "I maintain a to-do list of story ideas to write at Ars, and for about a year \"monthly column on DOS games I love\" has been near the top of the list. When we spoke with the team at GOG, it felt less like an obligation and more like a way to add another cool angle to what I was already planning to do.\nI'm going to start with the PC game I played most in high school and the one that introduced me to the very idea of online play. That game is Descent.\nAs far as I can recall, Descent was the first shooter to be fully 3D with six degrees of freedom. It's not often in today's gaming world that you get something completely and totally new, but that's exactly what Descent was 30 years ago in 1995.Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/gaming/2025/07/remembering-descent-the-once-popular-fully-3d-6dof-shooter/",
    "published_at": "2025-07-25T19:00:51",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.747262
  },
  {
    "id": "dbda2f55ae6e441e23358d96d2434ac7",
    "title": "Delta’s AI spying to “jack up” prices must be banned, lawmakers say",
    "summary": "Lawmakers want to prevent companies from using AI to increase prices or lower wages.",
    "content": "One week after Delta announced it is expanding a test using artificial intelligence to charge different prices based on customers' personal data—which critics fear could end cheap flights forever—Democratic lawmakers have moved to ban what they consider predatory surveillance pricing.\nIn a press release, Reps. Greg Casar (D-Texas) and Rashida Tlaib (D-Mich.) announced the Stop AI Price Gouging and Wage Fixing Act. The law directly bans companies from using \"surveillance-based\" price or wage setting to increase their profit margins.\nIf passed, the law would allow anyone to sue companies found unfairly using AI, lawmakers explained in what's called a \"one-sheet.\" That could mean charging customers higher prices—based on \"how desperate a customer is for a product and the maximum amount a customer is willing to pay\"—or paying employees lower wages—based on \"their financial status, personal associations, and demographics.\"Read full article\nComments",
    "source": "Ars Technica - All content",
    "url": "https://arstechnica.com/tech-policy/2025/07/deltas-ai-spying-to-jack-up-prices-must-be-banned-lawmakers-say/",
    "published_at": "2025-07-25T18:13:52",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583063.7475405
  },
  {
    "id": "478c8d24289f2a5ad705c7c4c69f1512",
    "title": "Here are the laptops I’d tell any parent to consider for their back-to-school student",
    "summary": "We’re in the heart of summer fun, but it’s already time for back-to-school planning, especially if that involves buying a new laptop. The dizzying number of different laptops and configurations can feel overwhelming, especially if you want something that doesn’t cost too much but will still last a l...",
    "content": "We’re in the heart of summer fun, but it’s already time for back-to-school planning, especially if that involves buying a new laptop.\nThe dizzying number of different laptops and configurations can feel overwhelming, especially if you want something that doesn’t cost too much but will still last a long time. My general guidelines are to first pick the operating system you need (based on personal preference or class requirements), and then get the best specs you can afford. If your school has specific requirements or recommendations, they are likely found on the school website. A quality laptop should also have a good screen, keyboard, and trackpad — and preferably enough ports and some decent speakers.\nUnless you’re buying a Chromebook, aim for an M4 processor (for Macs) or an Intel Core Ultra 5 or 7, an AMD Ryzen AI 300 series, or a Qualcomm Snapdragon X processor on a Windows machine, especially if you want your laptop to last at least four years. Aim for at least 16GB of RAM and 512GB of storage. If your budget allows for more RAM or storage then go for it, especially if neither is user-replaceable — it’ll help with performance and longevity. If you have to choose based on budget, prioritize RAM, since external storage is easily available.\nTaking much of that into account, here are our top picks among current laptops.\nThe best laptop for most students\nApple MacBook Air 13 (2025, M4)\n\nScore: 9ProsConsEasily lasts a full day on batteryExcellent choice for most people’s everyday needsNails the basics in a thin-and-light while feeling like a nice place to beStill starts with just 256GB of storageStill has limited portsStill prone to throttling under heavy creative tasks\nWhere to Buy: $999 $849 at Amazon $999 $849 at Best Buy $999 $949 at B&H Photo\nUnless you’re going into a field involving lots of graphics rendering or video editing, a MacBook Air should be more than enough computer to last through the student years. The Air is our top laptop recommendation for most people, and that includes students — particularly students in high school or starting college. Nothing else offers quite the same balance of performance, build quality, and battery life as Apple’s entry-level laptop. It’s a speedy little machine that can even handle some heftier content creation work. Its battery can easily get you through a packed day of classes. And it has the best trackpad around. The only major downside with an Air (as with all modern MacBooks) is that you can’t upgrade the storage or memory after you buy it.\nNow that MacBooks start with 16GB of RAM, even the base $999 13-inch model is excellent, if a little short on storage space at 256GB. So you may want to consider the $1,199 model with 512GB of storage. For the same price you can get the larger 15-inch model with roomier screen real estate and even better speakers, but then you’re once again starting with 256GB.\nApple MacBook Air 15 (2025, M4)\n\nScore: 9ProsConsEasily lasts a full day on batteryExcellent choice for most people’s everyday needsNails the basics in a thin-and-light while feeling like a nice place to beLouder speakers over its smaller counterpartStill starts with just 256GB of storageStill has limited portsStill prone to throttling under heavy creative tasks\nWhere to Buy: $1199 $1049 at Amazon $1199 $1049 at Best Buy $1199 $1069 at B&H Photo\nRead our review of the M4 MacBook Air.\n\nA note on older M-series Airs:\nThe original M1 MacBook Air can still be bought new from Walmart for $649 or less. Even at five years old, it remains a very good machine for those on tighter budgets, but it’s worth hunting for a deal on an M2 MacBook Air or newer if you can. That lingering M1 only has 8GB of RAM, and newer M2 and M3 versions have MagSafe chargers, better keyboards, and markedly better screens. You can often find one with 16GB of RAM for just a bit more than the M1, and it’ll be better for the long haul.\n\nThe best student laptop for serious content creation\nApple MacBook Pro 14 (2024, M4)\n\nScore: 9ProsConsEverything good about last year’s model but better All the I/O of the pricier MacBook ProsMore RAMNew webcam is sharp and clearNano-texture display is a nice add-onDesk View webcam feature is low-res and overly distortedSpace black finish can still be a little smudgyApple’s price structure may still have you longing for M4 Pro / Max\nWhere to Buy: $1599 $1432.75 at Amazon (16GB RAM, 512GB SSD) $1599 $1549 at B&H Photo (16GB RAM, 512GB SSD) $1799 $1609.66 at Amazon (16GB RAM, 1TB SSD)\nMacBook Pros have long been a staple on college campuses for students in creative fields, and the latest base version is one of the best laptops Apple has cooked up in years. Apple’s base model 14-inch MacBook Pro is a step up from the MacBook Air, with the same M4 chip. Its starting price of $1,599 is a significant jump from a $999 Air, but you get better performance and a bunch of worthwhile upgrades. The Pro has more ports than the Air, including an SD card reader and HDMI 2.1. Its screen is a nicer Mini LED panel with higher resolution and faster refresh rate. It’s got more ports, including an SD card reader and HDMI 2.1. It starts with 512GB of storage. And its battery lasts even longer. \nThese upgrades go a long way in making the MacBook Pro better and more futureproof for heavier creative tasks. Especially since it has a fan to cool its chip, allowing you to use content creation apps like the Adobe Creative Cloud suite for longer — the passively cooled Air starts off fast in these apps, but slows down considerably once its chip starts getting too hot.\nApple has two higher-end MacBook Pros: the 14- and 16-inch models running M4 Pro and M4 Max chips. They’re fantastic laptops with even more processing power than the base M4, plus upgrades like Thunderbolt 5 ports, but they start at $1,999 and $3,199, respectively. An M4 Pro model is a more futureproof option, but these are better fit for a working professional than a student.\nRead our review of the 14-inch MacBook Pro M4.\nThe best modular laptops you can upgrade yourself\nFramework Laptop 13 (2025, AMD Ryzen AI 7 350)\n\nScore: 9ProsConsStill the repairability champ with excellent, modular port selectionFaster CPU performance over both Intel and previous AMD modelsHigh-res 3:2 aspect ratio screen is great for productivityThin, light, and an overall great packageRadeon 860M iGPU performance is a little lackingTrackpad still feels a little cheapScreen is a little lacking in contrast and color qualityLess repairable laptops offer more for similar prices or less\nWhere to Buy: $899 at Framework\nThe Framework Laptop 13 and 2-in-1 Laptop 12 are notebooks that can grow and change with you. They’re easily repairable, and even years down the road you should be able to upgrade the RAM, storage, ports, and the entire mainboard and processor. They even have optional DIY editions, requiring some easy assembly — which I assure you is a joyously nerdy way to familiarize yourself with the inner workings of your laptop. There’s nothing else like them, and if you or your kid are the tinkering types it’s a fun experience for running either Windows or Linux.\nBut you don’t have to be going for a computer engineering degree. Even a newcomer can appreciate how Framework allows you to choose modular ports and swap them out at will. You can go all USB-C like a MacBook Air, or you can get funky by mixing and matching USB-A, DisplayPort, HDMI, SD / microSD card readers, and even an ethernet port. \nYou just have to be willing to pay extra for the Frameworks’ modularity, upgradeability, and easy repairability, as they cost more than equivalent or better-specced laptops from other manufacturers. The newer Laptop 12 isn’t as good a choice for most people because of its price and older Intel chips, but its shock-resistant chassis and convertible tablet form factor make it even more uniquely appealing for younger kids.\nFramework Laptop 12\n\nScore: 7ProsConsEasy repairs and potential upgradesFun designRubberized TPU edges make it more resilient for kidsModular ports with internal “child locks”Not exactly cheap, especially with more RAM and storageAging processor, starts with 8GB of RAMChunky bezelsNo Windows Hello unlocking\nWhere to Buy: $799 at Framework\nRead our reviews of the Framework Laptop 13 and Laptop 12.\nA Windows laptop or tablet with amazing battery\nMicrosoft Surface Laptop, 13-inch\n\nScore: 8ProsConsExquisite hardware that feels great to touch and useVery good keyboard and one of the best mechanical trackpadsBattery can stretch to 1.5 days (with native Arm apps)3:2 aspect ratio screen is ideal for productivityWebcam doesn’t support Windows HelloLoss of magnetic charging portSnapdragon X still has app and game compatibility issues that competing chips do notWhy have Home, Page Up, and Page Down keys instead of media controls?\nWhere to Buy: $899.99 at Microsoft $899.99 at Best Buy\nThe latest, lower-cost Surfaces from Microsoft are great machines with excellent battery life, great standby times when left asleep, and solid performance. They’re Arm-based, which is what gives them that excellent battery life, but can lead to some app compatibility issues. Most common programs run fine, either natively or native-like via emulation. Just do your homework; if certain classes require specific apps, check to make sure they’ll run.\nThe 12-inch Surface Pro (starting at $799.99) and 13-inch Laptop (starting at $899.99) are well constructed, ultra-portable machines that feel very nice to use. Despite being the cheaper Windows laptops in this list, neither feels like a diminished experience (save for some odd design choices, like a lack of face unlock in the Laptop). \nYou can look at it as simply picking your preferred form factor: a traditional clamshell laptop or a convertible tablet with keyboard cover. The Laptop is the better buy, because the Surface Pro’s must-buy keyboard cover is an extra $150 (or $250 bundled with the stylus) — meaning its true starting price is around $850. \nMicrosoft Surface Pro 12-inch\nMicrosoft’s latest Surface Pro is smaller, with a new design and updated keyboard. It’s powered by Qualcomm’s Arm64 Snapdragon X Plus chip. Read our review.\n\nScore: 8ProsConsBeautiful fanless designGreat battery lifeThe keyboard is a lot sturdierWindows still needs a better UX in tablet modeThe thick display bezelsNo haptic touchpad\nWhere to Buy: $799.99 $729.99 at Walmart $799.99 at Best Buy\nRead our reviews of the Surface Laptop 13-inch and Surface Pro 12-inch.\nThe hands-down best Chromebook\nLenovo Chromebook Plus 14\n\nScore: 9ProsConsBeautiful OLED screen, even at $649Marathon battery lifeSpeedy performance with fanless designGood-sounding speakersUSB ports are only 5GbpsTrackpad, while solid, has a slightly loud clickWebcam sometimes exhibits a green color castChromeOS app compatibility / performance can still be frustrating (e.g., Zoom and Slack)\nWhere to Buy: $749 at Best Buy $749 at Lenovo\nIf you need or prefer a Chromebook for school and favor a traditional clamshell laptop, the Lenovo Chromebook Plus 14 is the best one. It’s a great Chromebook for older students, and a solid machine for just about anyone who wants a no-nonsense everyday computer. For $750 you get a fantastic touchscreen OLED display with deep contrast and vivid colors, a great keyboard, and marathon battery life. It’s a package that’s well built and totally silent thanks to a fanless design.\nThe Arm-based MediaTek processor is what gives the Lenovo its zippy performance and battery stretching into a second day of use. It can also lead to some small compatibility issues if you venture into using Linux apps (they need to be Arm compatible), but that’s unlikely to affect most users.\nThe Chromebook Plus 14 has some other small flaws, like lackluster 5Gbps data speeds on its USB ports and an only-okay trackpad, but it nails most everything else. And, again, paying only $750 for a 14-inch OLED panel this nice is a rare treat. \nRead our review of the Lenovo Chromebook Plus 14.\nThe best 2-in-1 convertible Chromebook\nAcer Chromebook Plus Spin 714 (2024)\nAcer’s Spin Chromebook is configured with Intel’s first generation of processor with an NPU. It also has Google Gemini baked right into the OS, and if you sign up for a new Google One AI premium plan, your first year of service is free. \n\nProsConsThe best convertible Chromebook experienceSpeedy Thunderbolt 4 portsFaster RAM than previous genNo fingerprint sensorA little pricey when not discounted8GB of RAM\nWhere to Buy: $799 $629 at Best Buy\nIf you want a 2-in-1 convertible Chromebook, the Acer Chromebook Plus Spin 714 is your bag. The 2024 Acer may now be getting outclassed by the freshly launched Lenovo, but it’s still one of our top picks since it’s so versatile.\nThe Chromebook Spin 714 and its Intel processor offers a great balance of performance, battery life, and specs for the money. It has speedy Thunderbolt 4 ports, and its x86 architecture allows for free rein to install and tinker with Linux apps.\nNow that this latest version of the Spin is a year old (though still current), it can occasionally be had for $200 off. So if you want a top-flight Chromebook you can find for a decent discount, the Spin is a great choice.\nThe best Chromebook under $400\nChromebook Plus CX34\n\nScore: 8ProsConsExcellent look and buildSharp 1080p display1080p webcam with AI features and physical shutterNo touchscreen optionStiff touchpadBattery life could be a bit better\nWhere to Buy: $379 at Walmart (Intel Core i3) $599 at Best Buy (Intel Core i5) $599.99 at Asus (Intel Core i5)\nIf you’re shopping for a younger student and don’t want to spend a ton, but also don’t want to risk buying something crappy, the 14-inch Asus Chromebook Plus CX34 is a safe bet. It’s one of the cheapest Chromebooks with the Plus designation, which means it meets a certain level of performance, battery life, and quality. Chromebook Plus laptops have better-than-average screens, and they should be able to last through a school day without needing a charge. \nThe CX34 normally costs $600 these days, but it sometimes sells for under $400. That’s the sweet spot, getting you excellent build quality, a nice screen, and a sleek design for an affordable price.\nThe CX34’s 1920 x 1080 / 250-nit display may feel a little cramped and dim compared to the 16:10 screens on the Acer Chromebook Plus Spin 714 and Lenovo Chromebook Plus 14, but it offers a sharp picture with minimal glare. It’s got a great keyboard that Asus claims to have tested as spill-resistant, giving a bit more peace of mind when entrusting it to a child. The Asus remains a go-to choice for something you can have younger students use that lasts some years.\nRead our review of the Asus Chromebook Plus CX34.\nA great higher-end Windows laptop with a big screen\nAsus Zenbook S 16\n\nScore: 8ProsConsIt’s gorgeousIncredibly thin and light for a 16-inch laptopGreat performance, especially the integrated graphicsShorter battery life than major competitorsStoryCube doesn’t workCouldn’t get a sense of how fast the NPU really is\nWhere to Buy: $1799.99 $1399 at Asus $1799.99 at Best Buy\nSometimes bigger is better, and the Asus Zenbook S 16 is a total treat of a Windows thin-and-light laptop. It’s got AMD Strix Point processors that are powerful enough for even some light gaming, and the star of the show is its 2880 x 1800 16-inch OLED touchscreen capable of a smooth 120Hz refresh rate.\nThe Zenbook S 16 is one of the pricier options we have here, with a standard price of $1,799.99, but it sometimes goes on sale for as much as $500 off. This is a very capable option for high school or college students who need to run Windows and prefer a big screen for easier multitasking. And its thinness makes it very portable for a 16-inch machine, making it less of a hassle to tote a large laptop around campus. Asus also makes a 14-inch version — we expect it to be similar, but we haven’t tested the smaller model.\nThe downside of the Zenbook’s powerful chip and thin chassis is that it’s not the battery champ some of the other options here are. It’s still enough to get through an average day of classes, but it’s going to need a charge in the late afternoon if you have a lengthy sprint of back-to-back lectures or you’re cramming late into the night.\nRead our review of the Asus Zenbook S 16.\nThe best gaming laptop for (very responsible) students\nAsus ROG Zephyrus G14 (2025)\n\nProsConsBalanced performance, battery life, and portabilityOLED displayProgrammable LED strip on the lidGreat keyboard and smooth trackpadGets a bit hot and loud under loadSoldered RAMThermally throttles its GPUs\nWhere to Buy: $1799.99 $1349.99 at Best Buy (5060) $1799.99 at Asus $2399.99 $2049.99 at  Best Buy (5070 Ti)\nTreating your kid to a gaming laptop may seem like you’re inviting them to slack off, but if you want to splurge on one device for both schoolwork and play you can’t go wrong with Asus’ ROG Zephyrus G14. The G14 is as “normal” as gaming laptops get, with a design that doesn’t scream cringe-gamer too much (aside from some small ROG branding). Unlike many other gaming laptops, the Zephyrus has solid battery life that can get you through your day’s classes — assuming you save the gaming for when you plug in at the end of the day.\nThe $1,799.99 base model uses a capable AMD Ryzen 9 270 processor and discrete Nvidia GeForce RTX 5060, which is enough power to play just about any game, even the latest big-budget ones, albeit not at the highest settings.\nAn important part of what makes the G14 special is how good the rest of the laptop is. It’s got a crisp and lovely 14-inch OLED with 2880 x 1800 resolution and 120Hz refresh, a great keyboard, and a very good trackpad. It offers a bunch of ports, and it doesn’t run overly loud or hot when tackling the basic productivity stuff.\nYou’d be spoiling your kid a bit (maybe a lot of bit) with a laptop like this, but you can meet their school needs while also treating them to the world of PC gaming.\nRead our buying guide featuring the Asus ROG Zephyrus G14.",
    "source": "The Verge",
    "url": "https://www.theverge.com/this-is-my-next/713373/best-laptops-for-students",
    "published_at": "2025-07-26T14:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.028004
  },
  {
    "id": "add482f36bed3d734b439f4711f3c81d",
    "title": "Online MAGA cope is now Congressional strategy",
    "summary": "When it comes to defending Donald Trump from the worst accusations, the MAGA influencer-industrial complex, whether out of loyalty or self-preservation, often defaults to whataboutism, arguing that the Democrats are just as guilty as Trump, or (ideally) worse. This principle has held true with the c...",
    "content": "When it comes to defending Donald Trump from the worst accusations, the MAGA influencer-industrial complex, whether out of loyalty or self-preservation, often defaults to whataboutism, arguing that the Democrats are just as guilty as Trump, or (ideally) worse. This principle has held true with the current Jeffrey Epstein saga, and as their audience's anger against the Trump administration skyrockets, the MAGA influencer world is trying a new tack: blame the Democrats, not Trump, for keeping the \"Epstein Files\" under lock and key.\nTrump, the person who could feasibly order the release of said documents, has spent the past few weeks trying to …\nRead the full story at The Verge.",
    "source": "The Verge",
    "url": "https://www.theverge.com/politics/714144/epstein-files-maga-trump-influencers-congress",
    "published_at": "2025-07-26T13:30:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.0283246
  },
  {
    "id": "fde3de3e37c39002acb9aae956266255",
    "title": "The Drifter is a good old-fashioned thriller",
    "summary": "Point-and-click adventure games often tell silly, lighthearted stories. For me, the mishaps of the pirate Guybrush Threepwood in the Monkey Island series come to mind. The nature of the genre - wandering around, talking to people, and trying to solve puzzles - lends itself well to humor, as every in...",
    "content": "Point-and-click adventure games often tell silly, lighthearted stories. For me, the mishaps of the pirate Guybrush Threepwood in the Monkey Island series come to mind. The nature of the genre - wandering around, talking to people, and trying to solve puzzles - lends itself well to humor, as every interaction with a person or object offers an opportunity for a joke. The Drifter, a new point-and-click game from Powerhoof, cleverly uses the format to instead tell a dark, twist-filled thriller, and it sucked me in like a gripping novel.\nIn The Drifter, you play as Mick Carter, who you meet shortly after he hops aboard a train as a stowaway. Wit …\nRead the full story at The Verge.",
    "source": "The Verge",
    "url": "https://www.theverge.com/games-review/712020/the-drifter-review-pc",
    "published_at": "2025-07-26T13:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.0286083
  },
  {
    "id": "b4e546ae5c44ea34e3e0bfbefae44c63",
    "title": "OnePlus Nord 5 review: selfie-centric midranger",
    "summary": "The OnePlus Nord 5 does exactly what the company's Nord phones have always done: deliver strong specs at a relatively low price. It's one of the more powerful phones at this price point and should easily outstrip Samsung and Google's more expensive alternatives. This is a function-over-form phone, o...",
    "content": "The OnePlus Nord 5 does exactly what the company's Nord phones have always done: deliver strong specs at a relatively low price. It's one of the more powerful phones at this price point and should easily outstrip Samsung and Google's more expensive alternatives.\nThis is a function-over-form phone, one where the key selling points are a powerful processor and long battery life, which are the boring mainstays that tend to matter the most in midrange models like this. The problem for the Nord 5 is that other midrange phones in the markets where it's available - including Europe and India, but not the US - offer even faster chipsets and bigger  …\nRead the full story at The Verge.",
    "source": "The Verge",
    "url": "https://www.theverge.com/phones/712142/oneplus-nord-5-review",
    "published_at": "2025-07-26T12:30:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.0288346
  },
  {
    "id": "79b5b629d080b015721864cd975bcba4",
    "title": "Inside the struggle to create a cozy Lord of the Rings game",
    "summary": "When new employees start at Weta Workshop, they're herded into a meeting room with a long, unassuming conference table. On the walls, behind panes of glass and in between statues, swords, and masks, are five Oscars. Four of them were awarded to the studio for its efforts on Peter Jackson's The Lord ...",
    "content": "When new employees start at Weta Workshop, they're herded into a meeting room with a long, unassuming conference table. On the walls, behind panes of glass and in between statues, swords, and masks, are five Oscars. Four of them were awarded to the studio for its efforts on Peter Jackson's The Lord of the Rings films. New hires are offered a chance to hold one of those Oscars, but there's a catch: handling the golden statuette marks you with a curse, preventing you from ever winning one yourself. Rarely do inductees take Weta up on the offer.\nWeta Workshop's fledgling Game Studio hasn't achieved the same level of prestige as its film and sp …\nRead the full story at The Verge.",
    "source": "The Verge",
    "url": "https://www.theverge.com/games/709797/tales-of-the-shire-lotr-development-weta-workshop",
    "published_at": "2025-07-26T12:00:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.0290873
  },
  {
    "id": "bd235aae3a4b82dbd1701e8679465ef1",
    "title": "GPD’s monster Strix Halo handheld requires a battery ‘backpack’ or a 180W charger",
    "summary": "Yesterday, I mentioned how GPD is teasing the most potent handheld yet made — a GPD Win 5 that will house the Ryzen AI Max+ 395 chip, with AMD’s most powerful integrated graphics yet, inside a PlayStation Vita-shaped machine. If you’ve been wondering how that huge chip could even fit, handheld exper...",
    "content": "Yesterday, I mentioned how GPD is teasing the most potent handheld yet made — a GPD Win 5 that will house the Ryzen AI Max+ 395 chip, with AMD’s most powerful integrated graphics yet, inside a PlayStation Vita-shaped machine.\nIf you’ve been wondering how that huge chip could even fit, handheld expert Cary “The Phawx” Golomb now has the answer: the 7-inch handheld will apparently have no internal battery taking up space. The Win 5 is designed to either be plugged into the wall, with a gaming laptop sized 180-watt charger providing the juice — or powered by a big 80 watt-hour external battery “backpack” that will (only? additionally?) be sold separately.\n\nBreaking news! The GPD WIN 5 is expected to make its debut at Chinajoy 2025 pic.twitter.com/G6cwqajspJ— GPD Game Consoles (@softwincn) July 24, 2025\n\nWe can see the full spec sheet for the new Win 5 in the Phawx’s video, and as he notes, GPD had to make its Win 5 larger than the Win 4 even before you add that backpack battery. \nWhile the Win 4 is a compact 6-inch handheld with a 45 watt-hour pack, the Win 5 with its 7-inch screen will be narrower but thicker than the Asus ROG Ally X handheld — which is an apt comparison, considering that handheld similarly pairs a 7-inch screen with an 80 watt-hour battery pack.\nHere, though, the battery will add extra girth: it’s roughly 4 inches (110mm) wide and tall, and 0.7 inches (18mm) deep; it’s not clear how it attaches yet, as GPD has only shared the one dark video of the Win 5 filmed from the front, but the spec sheet mentions a “Battery to Host Dedicated Connector” as an accessory, so it might require plugging in a cable.\nIf you’re curious what the handheld’s controls might look like in better light, I tried brightening it up:\n\nOther intriguing things we can see in the full spec sheet include:\n\nA 120Hz variable refresh rate screen, where the Win 4 was limited to 60Hz\nTwo configs: AMD Ryzen AI Max+ 395 (16C/32T/ Radeon 8060S) or AI Max 385 (8C/16T/ Radeon 8050S)\n32, 64, or even the full 128GB of unified memory AMD offers for these chips\nUSB-4 with 100W PD charging and 8K/60 DP output\nTwo fans and four heat pipes for cooling\nAn optional HDMI and USB dock with a “battery charging slot,” presumably for the external battery\nNo mention of any integrated keyboard, whereas previous Win devices had a hidden keyboard underneath a sliding screen\n\nYou can peruse the whole sheet at your leisure in the Phawx’s video or the screenshots we took from Phawx (with his permission) below. Be sure to tap a couple of times to make them large enough for full reading.",
    "source": "The Verge",
    "url": "https://www.theverge.com/news/714294/gpd-win-5-strix-halo-specs-revealed",
    "published_at": "2025-07-25T23:19:12",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.0300438
  },
  {
    "id": "6b69c88cda0e96d9acb34ababc4b92c6",
    "title": "DJI couldn’t confirm or deny it disguised this drone to evade a US ban",
    "summary": "DJI barely sells drones in the United States anymore. The shelves are bare; resellers are jacking up prices. It appears an unofficial ban at US customs is to blame. But on Amazon, you can now buy a drone that's a a dead ringer for the DJI Mini 4 Pro - the SkyRover X1 - for […]",
    "content": "DJI barely sells drones in the United States anymore. The shelves are bare; resellers are jacking up prices. It appears an unofficial ban at US customs is to blame. But on Amazon, you can now buy a drone that's a a dead ringer for the DJI Mini 4 Pro - the SkyRover X1 - for a reasonable $758. And that's probably because DJI made it happen.\nThere's evidence suggesting so, and DJI was not able to deny the SkyRover X1 was a DJI product one day after we reached out.\nAs reported by DroneXL, security researchers have discovered the SkyRover X1 not only has the same specs, features, and an incredibly similar app to the one DJI provides for its dro …\nRead the full story at The Verge.",
    "source": "The Verge",
    "url": "https://www.theverge.com/report/714103/dji-skyrover-x1-evade-ban-amazon",
    "published_at": "2025-07-25T20:43:21",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.0304677
  },
  {
    "id": "be40f6418cad865c8e6122acb8ead7cd",
    "title": "Google gets its swag back",
    "summary": "This week, I take a look at the surprisingly strong state of Google, Meta gets a new chief AI researcher, and more. If you haven't already, be sure to check out this week's Decoder episode about deepfakes and where they are headed. Also, do you use an AI coding tool like Cursor or GitHub Copilot? […...",
    "content": "This week, I take a look at the surprisingly strong state of Google, Meta gets a new chief AI researcher, and more. If you haven't already, be sure to check out this week's Decoder episode about deepfakes and where they are headed.\nAlso, do you use an AI coding tool like Cursor or GitHub Copilot? I'd love to know what works and what doesn't…\n\n\"I think we are doing very well through this moment\"\nAfter spending time with Google executives during the company's I/O conference in May, it was clear that they were feeling confident. Now, I'm beginning to see why.\nChatGPT is not making Google Search obsolete. If anything, AI is making Google st …\nRead the full story at The Verge.",
    "source": "The Verge",
    "url": "https://www.theverge.com/command-line-newsletter/713603/google-search-chatgpt-openai-earnings-ai-race-swag",
    "published_at": "2025-07-25T19:52:59",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.0308695
  },
  {
    "id": "eccca8dc9df96e8573b163ab27f34700",
    "title": "Comcast&#8217;s fix for streaming service overload is in your cable box",
    "summary": "Streaming has become a tangled web of subscriptions, and now Comcast says it can help by putting all your services into one hub. Comcast is launching a new hub on its set-top boxes, called the StreamStore, where you can buy and manage subscriptions for more than 450 streaming apps and channels. The ...",
    "content": "Streaming has become a tangled web of subscriptions, and now Comcast says it can help by putting all your services into one hub. Comcast is launching a new hub on its set-top boxes, called the StreamStore, where you can buy and manage subscriptions for more than 450 streaming apps and channels.\nThe StreamStore lives within Xfinity’s Xumo Stream Box and on X1 devices. It’s also available on the web, and features a collection of more than 200,000 movies and TV shows to rent or purchase. Xfinity will let you add or drop channels through the store, while tacking on new subscriptions to your monthly internet or TV bill, further positioning the company as a sort of streaming broker. \nOther cable / telecom companies like Verizon have tried to step in as a digital subscription service middleman, though Comcast is taking things a step further by putting this hub on your TV. But is streaming really messy enough that you need Comcast to manage it?\nSome services included in the StreamStore include Netflix, Peacock, Disney Plus, Paramount Plus, Hulu, Apple TV Plus, HBO Max, and over 100 “niche” streaming subscriptions, according to LightReading. Xfinity already offers its own StreamSaver bundle, which includes a subscription to Apple TV Plus, Netflix with ads, and Peacock’s ad-supported plan for $15 per month.\nThe bundle is, of course, available through the StreamStore, and Xfinity says it plans on bringing new streaming bundles, apps, and “enhanced subscription management and activation capabilities” to the hub in the future.\n(Disclosure: Comcast is an investor in Vox Media, The Verge’s parent company.)",
    "source": "The Verge",
    "url": "https://www.theverge.com/news/714113/comcast-streamstore-xfinity-streaming-overload",
    "published_at": "2025-07-25T19:16:26",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.0321548
  },
  {
    "id": "1e734b260504b83ca336617501410b52",
    "title": "Breaking Bad creator’s new sci-fi show hits Apple in November",
    "summary": "As promised, Apple has finally revealed Pluribus, a new show from Breaking Bad creator Vince Gilligan that’s coming to Apple TV Plus. In addition to a very brief teaser involving some gross donut behavior, the streamer also confirmed that the show will premiere on November 7th. The show has been in ...",
    "content": "As promised, Apple has finally revealed Pluribus, a new show from Breaking Bad creator Vince Gilligan that’s coming to Apple TV Plus. In addition to a very brief teaser involving some gross donut behavior, the streamer also confirmed that the show will premiere on November 7th.\nThe show has been in the works for a while, as Apple first announced that it had picked up a Gilligan project back in 2022. It stars Rhea Seehorn, who previously worked with Gilligan on Better Call Saul. But there aren’t a lot of details other than that. According to Apple, the show — which is already confirmed for a second season –is about “the most miserable person on Earth” who “must save the world from happiness.” The rest of the cast includes Karolina Wydra, Carlos Manuel Vesga, Miriam Shor, and Samba Schutte.\nWhile details are slim, we do at least have one single image of Seehorn in the show:\n\nPluribus also adds to an ever-growing lineup of science fiction series on Apple TV Plus, including recent shows like Murderbot and new seasons of Foundation and Invasion, along with upcoming projects like an adaptation of Neuromancer.",
    "source": "The Verge",
    "url": "https://www.theverge.com/news/714080/pluribus-trailer-date-apple-tv-plus",
    "published_at": "2025-07-25T19:09:17",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.033378
  },
  {
    "id": "8a9539facec79d73b7f9958c236aac48",
    "title": "Why AI is making us lose our minds (and not in the way you’d think)",
    "summary": "The question isn’t, “will you use AI?” The question is, “what kind of AI user do you want to be: driver or passenger?”",
    "content": "The question isn’t, “will you use AI?” The question is, “what kind of AI user do you want to be: driver or passenger?”Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/why-ai-is-making-us-lose-our-minds-and-not-in-the-way-youd-think/",
    "published_at": "2025-07-26T20:45:00",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.7154715
  },
  {
    "id": "56dcf895b2f0c427dc94af8b0d283f44",
    "title": "Meta announces its Superintelligence Labs Chief Scientist: former OpenAI GPT-4 co-creator Shengjia Zhao",
    "summary": "The move underscores Meta’s strategy of spending aggressively now to secure a dominant position in what it views as the next foundational technology platform.",
    "content": "The move underscores Meta’s strategy of spending aggressively now to secure a dominant position in what it views as the next foundational technology platform.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/meta-announces-its-superintelligence-labs-chief-scientist-former-openai-gpt-4-co-creator-shengjia-zhao/",
    "published_at": "2025-07-26T00:58:24",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.7156491
  },
  {
    "id": "75910de2636a6d2e68d7f7854fa5a056",
    "title": "New AI architecture delivers 100x faster reasoning than LLMs with just 1,000 training examples",
    "summary": "Hierarchical Reasoning Models (HRM) tackle complex reasoning tasks while being smaller, faster, and more data-efficient than large AI models.",
    "content": "Hierarchical Reasoning Models (HRM) tackle complex reasoning tasks while being smaller, faster, and more data-efficient than large AI models.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/new-ai-architecture-delivers-100x-faster-reasoning-than-llms-with-just-1000-training-examples/",
    "published_at": "2025-07-25T23:27:42",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.7158003
  },
  {
    "id": "f00a27e97c236cc6b0f01b69e88eeec4",
    "title": "CoSyn: The open-source tool that’s making GPT-4V-level vision AI accessible to everyone",
    "summary": "Researchers at the University of Pennsylvania and the Allen Institute for Artificial Intelligence have developed a groundbreaking tool that allows open-source AI systems to match or surpass the visual understanding capabilities of proprietary models like GPT-4V and Gemini 1.5 Flash, potentially resh...",
    "content": "Researchers at the University of Pennsylvania and the Allen Institute for Artificial Intelligence have developed a groundbreaking tool that allows open-source AI systems to match or surpass the visual understanding capabilities of proprietary models like GPT-4V and Gemini 1.5 Flash, potentially reshaping the competitive landscape between open and c…Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/business/cosyn-the-open-source-tool-thats-making-gpt-4v-level-vision-ai-accessible-to-everyone/",
    "published_at": "2025-07-25T20:05:12",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.721558
  },
  {
    "id": "3641685fc3b39a7debe6e2bd4bface3c",
    "title": "It’s Qwen’s summer: new open source Qwen3-235B-A22B-Thinking-2507 tops OpenAI, Gemini reasoning models on key benchmarks",
    "summary": "The new Qwen3-Thinking-2507, as we'll call it for short, now leads or closely trails top-performing models across several major benchmarks.",
    "content": "The new Qwen3-Thinking-2507, as we'll call it for short, now leads or closely trails top-performing models across several major benchmarks.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/its-qwens-summer-new-open-source-qwen3-235b-a22b-thinking-2507-tops-openai-gemini-reasoning-models-on-key-benchmarks/",
    "published_at": "2025-07-25T15:47:28",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.7217968
  },
  {
    "id": "23aeae13db8631048181c32cd1fc219c",
    "title": "Anthropic unveils ‘auditing agents’ to test for AI misalignment",
    "summary": "Anthropic developed its auditing agents while testing Claude Opus 4 for alignment issues.",
    "content": "Anthropic developed its auditing agents while testing Claude Opus 4 for alignment issues.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/anthropic-unveils-auditing-agents-to-test-for-ai-misalignment/",
    "published_at": "2025-07-24T22:15:53",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.7219496
  },
  {
    "id": "137bc730f668571791e6a2a2dae02293",
    "title": "Freed says 20,000 clinicians are using its medical AI transcription ‘scribe,’ but competition is rising fast",
    "summary": "Rather than chase enterprise contracts with large hospital systems, Freed has focused on small clinics and solo practitioners.",
    "content": "Rather than chase enterprise contracts with large hospital systems, Freed has focused on small clinics and solo practitioners.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/freed-says-20000-clinicians-are-using-its-medical-ai-transcription-scribe-but-competition-is-rising-fast/",
    "published_at": "2025-07-24T21:46:29",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.7220843
  },
  {
    "id": "78e2e4a7202ea68191e58f88196fdf5f",
    "title": "White House plan signals “open-weight first” era—and enterprises need new guardrails",
    "summary": "Enterprises will not see immediate impact from the AI Action Plan, but it signals wider support for open-source models and evaluations.",
    "content": "Enterprises will not see immediate impact from the AI Action Plan, but it signals wider support for open-source models and evaluations.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/ai/white-house-plan-signals-open-weight-first-era-and-enterprises-need-new-guardrails/",
    "published_at": "2025-07-23T23:24:14",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.7222402
  },
  {
    "id": "74cee7a7e31c5fea7fcff8660bad074e",
    "title": "SecurityPal combines AI and experts in Nepal to speed enterprise security questionnaires by 87X or more",
    "summary": "The Kathmandu center of excellence gives SecurityPal a cost base low enough to keep humans in the loop while staying price-competitive.",
    "content": "The Kathmandu center of excellence gives SecurityPal a cost base low enough to keep humans in the loop while staying price-competitive.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/security/securitypal-combines-ai-and-experts-in-nepal-to-speed-enterprise-security-questionnaires-by-87x-or-more/",
    "published_at": "2025-07-23T22:41:32",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.7223747
  },
  {
    "id": "b407b23043aca58da4d816f811b2fe84",
    "title": "Qwen3-Coder-480B-A35B-Instruct launches and it ‘might be the best coding model yet’",
    "summary": "Developers can define custom tools and let Qwen3-Coder dynamically invoke them during conversation or code generation tasks.",
    "content": "Developers can define custom tools and let Qwen3-Coder dynamically invoke them during conversation or code generation tasks.Read More",
    "source": "VentureBeat",
    "url": "https://venturebeat.com/programming-development/qwen3-coder-480b-a35b-instruct-launches-and-it-might-be-the-best-coding-model-yet/",
    "published_at": "2025-07-23T21:49:39",
    "category": "technology",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583064.7224998
  },
  {
    "id": "b571593d38b5a7730622334d0548b4bc",
    "title": "Author Correction: Immune evasion through mitochondrial transfer in the tumour microenvironment",
    "summary": "Nature, Published online: 25 July 2025; doi:10.1038/s41586-025-09408-xAuthor Correction: Immune evasion through mitochondrial transfer in the tumour microenvironment",
    "content": "Nature, Published online: 25 July 2025; doi:10.1038/s41586-025-09408-xAuthor Correction: Immune evasion through mitochondrial transfer in the tumour microenvironment",
    "source": "Nature",
    "url": "https://www.nature.com/articles/s41586-025-09408-x",
    "published_at": "2025-07-25T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583067.1911855
  },
  {
    "id": "59c5dcf4ccf721d23e4d30905ee85830",
    "title": "Author Correction: Human HDAC6 senses valine abundancy to regulate DNA damage",
    "summary": "Nature, Published online: 25 July 2025; doi:10.1038/s41586-025-09409-wAuthor Correction: Human HDAC6 senses valine abundancy to regulate DNA damage",
    "content": "Nature, Published online: 25 July 2025; doi:10.1038/s41586-025-09409-wAuthor Correction: Human HDAC6 senses valine abundancy to regulate DNA damage",
    "source": "Nature",
    "url": "https://www.nature.com/articles/s41586-025-09409-w",
    "published_at": "2025-07-25T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583067.1913557
  },
  {
    "id": "0312d68792a266e8d8c22d5b61c3d121",
    "title": "Ageing accelerates around age 50 ― some organs faster than others",
    "summary": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-02333-zAn analysis of how various tissues age is the latest to suggest that ageing does not march to a steady beat.",
    "content": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-02333-zAn analysis of how various tissues age is the latest to suggest that ageing does not march to a steady beat.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02333-z",
    "published_at": "2025-07-25T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583067.1914947
  },
  {
    "id": "eb9ef60bb61e9bcc0bd7b02c6fc2afcd",
    "title": "Mystery food in Neanderthal diet might be maggots",
    "summary": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-02334-yStudy of rotting human cadavers hints that a puzzling chemical marker in Neanderthal remains could be from eating the larvae.",
    "content": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-02334-yStudy of rotting human cadavers hints that a puzzling chemical marker in Neanderthal remains could be from eating the larvae.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02334-y",
    "published_at": "2025-07-25T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583067.1916506
  },
  {
    "id": "b3037b56ac077e63961e34ae11147006",
    "title": "How to tackle research misconduct: survey finds stark disagreement",
    "summary": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-02365-5Data sleuths and research-integrity officers have different views on how to handle allegations of wrongdoing in science.",
    "content": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-02365-5Data sleuths and research-integrity officers have different views on how to handle allegations of wrongdoing in science.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02365-5",
    "published_at": "2025-07-25T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583067.1917949
  },
  {
    "id": "786198b565b6afbe4c6c506952fad1b7",
    "title": "Meet the early career scientists planning to leave the United States",
    "summary": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-01900-8Decreased funding, reduced opportunities and growing uncertainty has made life tough for international postdocs living in the US.",
    "content": "Nature, Published online: 25 July 2025; doi:10.1038/d41586-025-01900-8Decreased funding, reduced opportunities and growing uncertainty has made life tough for international postdocs living in the US.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-01900-8",
    "published_at": "2025-07-25T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583067.1920545
  },
  {
    "id": "1947c43e283eaa8830ce7871921f4b3d",
    "title": "This fish-inspired suction cup can stick to your organs",
    "summary": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02361-9The device could be swallowed for drug delivery or medical monitoring.",
    "content": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02361-9The device could be swallowed for drug delivery or medical monitoring.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02361-9",
    "published_at": "2025-07-24T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583067.1922126
  },
  {
    "id": "a257345aebdb8f86af9edee68c9e133c",
    "title": "Unexpected danger lurks in this giant fault in the Yukon",
    "summary": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02310-6The Tintina fault has triggered many more earthquakes than was thought — and a build-up of strain poses a hazard.",
    "content": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02310-6The Tintina fault has triggered many more earthquakes than was thought — and a build-up of strain poses a hazard.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02310-6",
    "published_at": "2025-07-24T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583067.192366
  },
  {
    "id": "0eb449c17a7f8b0e5cb47eea7bf2e39a",
    "title": "Daily briefing: Damaging the climate could violate international law, court rules",
    "summary": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02369-1A landmark court ruling could open the door for nations most affected by climate change to sue the most polluting countries. Plus, an artificial intelligence model that can predict lost Latin text and a fish-inspired medical devic...",
    "content": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02369-1A landmark court ruling could open the door for nations most affected by climate change to sue the most polluting countries. Plus, an artificial intelligence model that can predict lost Latin text and a fish-inspired medical device that sticks to slippery surfaces.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02369-1",
    "published_at": "2025-07-24T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583067.192514
  },
  {
    "id": "051b64c20f6b738e24d5268b6a2170a2",
    "title": "DeepMind and OpenAI models solve maths problems at level of top students",
    "summary": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02343-xFor the first time, large language models performed on a par with gold medallists in the International Mathematical Olympiad.",
    "content": "Nature, Published online: 24 July 2025; doi:10.1038/d41586-025-02343-xFor the first time, large language models performed on a par with gold medallists in the International Mathematical Olympiad.",
    "source": "Nature",
    "url": "https://www.nature.com/articles/d41586-025-02343-x",
    "published_at": "2025-07-24T00:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583067.1926796
  },
  {
    "id": "2849cc136d78202d8cef281cbb17fb07",
    "title": "USDA reorganization will cut agricultural and forest research",
    "summary": "One of the agency’s largest and most storied research facilities will be closed along with most forest research stations",
    "content": "One of the agency’s largest and most storied research facilities will be closed along with most forest research stations",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/usda-reorganization-will-cut-agricultural-and-forest-research",
    "published_at": "2025-07-25T05:30:04",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583068.9731956
  },
  {
    "id": "0f2d4217c3dabf4e4062c0cccf114633",
    "title": "‘Things keep evolving into anteaters.’ Odd animals arose at least 12 separate times",
    "summary": "Findings speak to the dramatic impact ants and termites can have on mammalian evolution",
    "content": "Findings speak to the dramatic impact ants and termites can have on mammalian evolution",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/things-keep-evolving-anteaters-odd-animals-arose-least-12-separate-times",
    "published_at": "2025-07-25T02:05:12",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583068.973271
  },
  {
    "id": "10e441f6828f1a77ff24684d73e213fa",
    "title": "Congressional panels resist White House proposals for sharp cuts in indirect cost rates",
    "summary": "Three spending panels say a 15% cap isn’t the right answer to nagging concerns about how universities are reimbursed",
    "content": "Three spending panels say a 15% cap isn’t the right answer to nagging concerns about how universities are reimbursed",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/congressional-panels-resist-white-house-proposals-sharp-cuts-indirect-cost-rates",
    "published_at": "2025-07-25T11:45:01",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583068.9733326
  },
  {
    "id": "d3100801ff04dd52dea55f3ae4d9d796",
    "title": "Columbia’s $221 million deal with Trump officials draws mixed reactions from researchers",
    "summary": "Relief that NIH funding will be restored mingles with fears that academic independence will suffer—and that other universities will make similar concessions",
    "content": "Relief that NIH funding will be restored mingles with fears that academic independence will suffer—and that other universities will make similar concessions",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/columbia-s-221-million-deal-trump-officials-draws-mixed-reactions-researchers",
    "published_at": "2025-07-24T08:45:32",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583068.973392
  },
  {
    "id": "86f4120bf7212e6e7bd64ec568b6e6d8",
    "title": "This trilobite fossil became ancient Roman bling",
    "summary": "It’s the first example of this common fossil found in the ancient Roman world",
    "content": "It’s the first example of this common fossil found in the ancient Roman world",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/trilobite-fossil-became-ancient-roman-bling",
    "published_at": "2025-07-24T05:10:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583068.9734476
  },
  {
    "id": "eeb238232ec086410f387bd44dd1424b",
    "title": "Fifteen years later, <cite>Science</cite> retracts ‘arsenic life’ paper despite study authors’ protests",
    "summary": "Belated decision on widely disputed 2010 study pleases some critics but puzzles and dismays others",
    "content": "Belated decision on widely disputed 2010 study pleases some critics but puzzles and dismays others",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/fifteen-years-later-science-retracts-arsenic-life-paper-despite-study-authors",
    "published_at": "2025-07-24T02:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583068.9735036
  },
  {
    "id": "264026746a6cef3cfc08df71568d68f2",
    "title": "Three ancient human relatives once shared the same valley. Did they meet—and compete?",
    "summary": "The world’s greatest concentration of ancestral human remains, in South Africa, poses a 2-million-year-old riddle of coexistence",
    "content": "The world’s greatest concentration of ancestral human remains, in South Africa, poses a 2-million-year-old riddle of coexistence",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/three-ancient-human-relatives-once-shared-same-valley-did-they-meet-and-compete",
    "published_at": "2025-07-24T02:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583068.9735634
  },
  {
    "id": "9359e6c3fa8d5086ddc60c0c812ea27e",
    "title": "Trump’s plan to slash global health spending rejected by key spending panel",
    "summary": "House of Representatives committee signals support for HIV/AIDS and other funding",
    "content": "House of Representatives committee signals support for HIV/AIDS and other funding",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/trump-s-plan-slash-global-health-spending-rejected-key-spending-panel",
    "published_at": "2025-07-23T05:25:53",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583068.9736204
  },
  {
    "id": "0d2dbba65ed2f909cf6d292f82c56c3e",
    "title": "Cheap drug could fight malaria by spoiling mosquitoes’ blood meal",
    "summary": "Field study in Kenya suggests innovative strategy has promise—but some researchers question its viability",
    "content": "Field study in Kenya suggests innovative strategy has promise—but some researchers question its viability",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/well-known-drug-could-make-human-blood-toxic-malaria-transmitting-mosquitoes",
    "published_at": "2025-07-23T05:00:00",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583068.9736784
  },
  {
    "id": "96811b6e824509bde51791ff128608cb",
    "title": "Songbirds play optical tricks to make their feather colors ‘pop’",
    "summary": "Concealed black or white bands on feathers boost the vibrancy of bird plumage",
    "content": "Concealed black or white bands on feathers boost the vibrancy of bird plumage",
    "source": "Latest News from Science Magazine",
    "url": "https://www.science.org/content/article/songbirds-play-optical-tricks-make-their-feather-colors-pop",
    "published_at": "2025-07-23T02:00:08",
    "category": "science",
    "language": "en",
    "importance": 0.6,
    "processed_at": 1753583068.9737332
  },
  {
    "id": "60d772e41afd63f7a3239f4653baf52a",
    "title": "Revolutionary AI Breakthrough in Local Processing",
    "summary": "Researchers achieve significant improvements in on-device AI processing, enabling faster and more private artificial intelligence applications.",
    "content": "A team of researchers has developed new techniques for optimizing AI models to run efficiently on local devices, reducing the need for cloud processing and improving user privacy. The breakthrough includes novel quantization methods and hardware acceleration techniques.",
    "source": "Mock_News",
    "url": "https://example.com/article/technology/0",
    "published_at": "2025-07-27T09:24:28.973809",
    "category": "technology",
    "language": "en",
    "importance": 0.9,
    "processed_at": 1753583068.9738145
  },
  {
    "id": "1e729746135aa71156faf3f5971697d8",
    "title": "Voice AI Systems Reach Human-Level Understanding",
    "summary": "Latest voice recognition and response systems demonstrate unprecedented accuracy in natural language understanding and generation.",
    "content": "Modern voice assistant technology has achieved remarkable milestones in understanding context, emotion, and nuanced human communication, making interactions more natural and helpful than ever before.",
    "source": "Mock_News",
    "url": "https://example.com/article/technology/1",
    "published_at": "2025-07-27T08:24:28.973818",
    "category": "technology",
    "language": "en",
    "importance": 0.8,
    "processed_at": 1753583068.9738212
  },
  {
    "id": "d41c3765538db964d5378aaca5837834",
    "title": "Quantum Computing Achieves New Stability Record",
    "summary": "Scientists maintain quantum coherence for record-breaking duration, bringing practical quantum computers closer to reality.",
    "content": "A breakthrough in quantum error correction and coherence maintenance has been achieved, with quantum states remaining stable for over 100 seconds under controlled conditions.",
    "source": "Mock_News",
    "url": "https://example.com/article/science/0",
    "published_at": "2025-07-27T09:24:28.973824",
    "category": "science",
    "language": "en",
    "importance": 0.8,
    "processed_at": 1753583068.973826
  }
]